{
    "insecticides": [
        {
            "name": "Bayer Advanced Complete",
            "chemical": "Imidacloprid, Bifenthrin",
            "image": "Insecticides/bayer-advanced-complete.png",
            "description": "Bayer Advanced Complete (also sold under the BioAdvanced brand) is a dual-action lawn insecticide specifically formulated to tackle both surface-dwelling and soil-buried pests in turf and garden areas. Its active ingredients, imidacloprid and beta-cyfluthrin, work together: the surface insects (such as ants, ticks, fleas, chinch bugs and mole crickets) are killed within about 24 hours, while below-ground pests (like grubs and crane fly larvae) receive up to 90 days of control. Available as dry granules or a convenient ready-to-spray concentrate, it covers approximately 5,000 sq ft per quart (RTS form) or up to 10,000 sq ft per 10-pound bag (granular form) depending on the pest and application method. Both forms are pet-safe when used according to the label instructions, and the ready-to-spray option eliminates measuring or mixing. There have been no formulation changes since Bayer's sale of its home-garden division to BioAdvanced, and the product has retained the same chemical composition despite rebranding.",
            "application": "To apply Bayer Advanced Complete Insect Killer to your lawn, first choose the appropriate form (granules or ready-to-spray liquid). For granules, use a broadcast spreader to evenly distribute the product over dry grass, then immediately water the area to activate the ingredients. For the ready-to-spray version, connect the bottle to a garden hose, turn on the water, and spray evenly across your lawn until it's lightly saturated. Apply when the lawn is dry and no rain is expected for at least 24 hours, unless watering is required. Always follow the label instructions for application rates and safety precautions.",
            "legality": "In Canada, Bayer Advanced Complete, which contains the active ingredients imidacloprid and beta-cyfluthrin, is not legal for use on lawns or turf. Health Canada's Pest Management Regulatory Agency cancelled all non-agricultural turf and foliar uses of imidacloprid as of May 19, 2023. This means applications on lawns, including typical home use products, are unauthorized and prohibited in Canada. <br><br>Health Canada requires that all pesticides be registered and used strictly in accordance with their labels. Using a pesticide for an unregistered application is a violation of the Pest Control Products Act and may result in enforcement action. Furthermore, consumer reports on platforms like Reddit indicate that systemic insecticides such as imidacloprid are generally not available for retail sale in Canada, and acquiring them via international import can lead to seizure by border authorities or large fines, particularly if done without proper licensing",
            "pros": "Bayer Advanced Complete has several advantages for homeowners looking to control lawn pests. It provides fast and long-lasting protection, killing surface insects like ants and ticks within 24 hours and controlling soil pests like grubs for up to three months. The product comes in both granular and ready-to-spray liquid forms, making application flexible and convenient. It also treats a wide range of pests in a single step, reducing the need for multiple products. When used correctly, it helps keep lawns healthy and free of damaging insects.",
            "cons": "Bayer Advanced Complete also comes with a few drawbacks. Its active ingredients, particularly imidacloprid, have raised environmental concerns due to their potential impact on pollinators like bees and on beneficial insects. It is not approved for lawn use in Canada, limiting availability and legality in certain regions. Overuse or improper application can lead to runoff and contamination of nearby water sources. Additionally, while effective, it is a chemical solution that may not suit those looking for organic or eco-friendly pest control options.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "bayer-advanced-complete"
        },
        {
            "name": "Bonide Insecticidal Soap",
            "chemical": "Potassium Salts of Fatty Acids",
            "image": "Insecticides/bonide-soap.jpg",
            "description": "Bonide Insecticidal Soap is a contact insecticide made from potassium salts of fatty acids, designed to control soft-bodied insects like aphids, whiteflies, mealybugs, spider mites, and scale on vegetables, fruits, flowers, and houseplants. It works by breaking down the outer shell of insects, causing them to dehydrate and die quickly, usually within minutes. This product is favored by gardeners looking for a more environmentally friendly option, as it contains no harsh chemicals and is safe to use around people and pets when used as directed. It is also OMRI-listed for organic gardening, making it suitable for those following organic practices. However, because it only works on direct contact, thorough coverage and repeated applications may be necessary for full control.",
            "application": "To apply Bonide Insecticidal Soap to your lawn, start by making sure the area is well-watered and not under stress from heat or drought. Attach the hose-end sprayer if using the ready-to-spray version, or mix the concentrate according to the label instructions if using a handheld sprayer. Spray the solution directly onto affected areas, focusing on spots where pests are active. Be sure to coat the insects thoroughly, as the product only works on contact. Apply early in the morning or late in the evening to avoid leaf burn, and repeat every 7 to 10 days as needed. Avoid spraying in direct sunlight or when rain is expected within a few hours.",
            "legality": "In Canada, Bonide Insecticidal Soap is generally legal for use on ornamental plants, flowers, vegetables, and houseplants, provided it is registered with Health Canada's Pest Management Regulatory Agency (PMRA) and used according to the label instructions. The product is typically registered under the brand name Safer's Insecticidal Soap. However, it is not approved for use on lawns or turf. Specifically, the PMRA has not registered insecticidal soap products for controlling pests like chinch bugs on lawns, even though such use is permitted in the United States. This discrepancy means that using insecticidal soap on lawns in Canada is not legal and could be considered a violation of the Pest Control Products Act.",
            "pros": "Bonide Insecticidal Soap offers a natural and effective way to control soft-bodied insects like aphids, whiteflies, and spider mites without using harsh chemicals. It works quickly by breaking down the pests' outer protective layer, leading to rapid dehydration and death. Because it is made from fatty acids, it is considered safer for people, pets, and beneficial insects when used as directed. The product is also approved for organic gardening, making it a popular choice for those seeking environmentally friendly pest control options.",
            "cons": "Bonide Insecticidal Soap has some limitations to consider. It only works on insects it directly contacts, so thorough and frequent applications are often necessary to achieve full control. It may not be effective against tougher or hard-shelled pests. Additionally, it can sometimes cause leaf burn or damage if applied in hot, sunny weather or to sensitive plants. Because it breaks down quickly, its effects are short-lived, requiring repeated treatments to keep pests in check.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "bonide-insecticidal-soap"
        },
        {
            "name": "Bonide Pyrethrin Garden Insect Spray",
            "chemical": "Pyrethrins, Piperonyl Butoxide",
            "image": "Insecticides/bonide-pyrethrin.jpg",
            "description": "Bonide Pyrethrin Garden Insect Spray is a fast-acting insecticide formulated with natural pyrethrins derived from chrysanthemum flowers. This product is effective against a wide range of garden pests, including aphids, beetles, leafhoppers, webworms, and cabbage loopers. It is suitable for use on vegetables, fruits, flowers, and ornamentals, and can be applied up to the day of harvest without leaving objectionable residues. The spray mixes readily with water and can be applied using a sprinkler can, hand sprayer, or low-pressure sprayer. Bonide Pyrethrin Garden Insect Spray is an ideal choice for gardeners seeking a biodegradable and effective solution for pest control.",
            "application": "To apply Bonide Pyrethrin Garden Insect Spray to your lawn, first dilute the concentrate according to the instructions on the label. Use a garden sprayer to evenly apply the solution over the affected areas of your lawn, targeting pests directly. Make sure to spray during calm weather to avoid drift and avoid applying during the hottest part of the day to prevent plant damage. Reapply as needed, following the recommended interval on the label, and always wear protective gear during application.",
            "legality": "In Canada, Bonide Pyrethrin Garden Insect Spray is not registered for sale or use. Health Canada's Pest Management Regulatory Agency (PMRA) has not approved this specific product, and it is not listed in the Pesticide Product Information Database (PPID). While pyrethrins themselves are registered in Canada for certain uses, including on vegetables and ornamentals, the specific formulations and concentrations in Bonide's product are not authorized. Using unregistered pesticides is a violation of the Pest Control Products Act, and such products may be subject to seizure or fines if imported or used without proper authorization. Therefore, it's advisable to seek out registered alternatives that are approved for use in Canada.",
            "pros": "Bonide Pyrethrin Garden Insect Spray offers several advantages for gardeners seeking effective pest control. Its active ingredient, pyrethrin, is a natural compound derived from chrysanthemum flowers, providing a biodegradable and eco-friendly option for managing pests. The spray is fast-acting, effectively targeting a wide range of insects such as aphids, beetles, webworms, and leafhoppers. It can be used up to the day of harvest without leaving objectionable residues, making it safe for edible plants. Additionally, the concentrate mixes easily with water and can be applied using various sprayers, offering convenience for gardeners.",
            "cons": "Bonide Pyrethrin Garden Insect Spray, while effective, has several drawbacks to consider. Its active ingredients, pyrethrins and piperonyl butoxide (PBO), are not registered for use on lawns in Canada, making such applications illegal and potentially subject to regulatory penalties. Additionally, pyrethrins are broad-spectrum insecticides, meaning they can harm beneficial insects like bees and ladybugs, especially if applied during active pollination periods. Environmental factors such as temperature and humidity can also influence its effectiveness and potential phytotoxicity. Lastly, while pyrethrins are derived from chrysanthemums and are biodegradable, they can still pose risks to aquatic life if runoff occurs. Therefore, it's crucial to use this product responsibly and in accordance with local regulations.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "bonide-pyrethrin-garden-insect-spray"
        },
        {
            "name": "Doktor Doom Premium 3-in-1 Crop & Plant Rescue",
            "chemical": "Canola Oil",
            "image": "Insecticides/doktor-doom-premium-3-in-1.jpg",
            "description": "Doktor Doom Premium 3-in-1 Crop & Plant Rescue is a versatile pesticide formulated to address a range of common garden pests and diseases. This concentrate acts as an insecticide, miticide, and fungicide, effectively controlling pests such as aphids, mealybugs, spider mites, scale, whiteflies, and certain types of phylloxera. Additionally, it suppresses powdery mildew, making it suitable for both indoor and outdoor applications, including use in greenhouses. The product is safe for use on food crops, vegetables, and fruit trees up to the day of harvest, providing flexibility for gardeners. Its concentrated formula dilutes to make up to 50 liters of solution, offering cost-effective coverage for extensive areas. Available in 1-liter bottles, it is accessible through various Canadian retailers, including Grow It All in Toronto, The Green Spot in Brandon, and Nutrient Growth Systems.",
            "application": "To apply Doktor Doom Premium 3-in-1 Crop & Plant Rescue to your lawn, first prepare a 2% solution by mixing 20 mL of concentrate with 1 L of water. Use a hand-held trigger sprayer, backpack sprayer, or hose-end applicator to apply the solution at a rate of 100-200 mL per square meter. Ensure thorough coverage, including the undersides of leaves, and apply at the first sign of insect presence. Reapply every 7-14 days if needed. This product is safe for use on lawns and can also suppress powdery mildew when applied to both upper and lower leaf surfaces.",
            "legality": "Doktor Doom Premium 3-in-1 Crop & Plant Rescue is a registered pesticide in Canada, approved by Health Canada under Pest Management Regulatory Agency (PMRA) Registration Number 33217. This product contains canola oil as its active ingredient and is classified as an acaricide, insecticide, and fungicide. It is legally approved for use on various crops, including fruits, vegetables, and ornamentals, both indoors and outdoors. The product is safe for use up to the day of harvest, making it suitable for organic gardening practices. However, it's important to follow the manufacturer's guidelines and local regulations when applying this product. For more detailed information, you can refer to the official Health Canada PMRA database.",
            "pros": "Doktor Doom Premium 3-in-1 Crop & Plant Rescue offers several advantages for gardeners seeking effective and eco-friendly pest and disease control. Its triple-action formula combines an insecticide, miticide, and fungicide, effectively targeting a wide range of pests such as aphids, mealybugs, spider mites, scale, and whiteflies, as well as suppressing powdery mildew. The product is safe for use on food crops, vegetables, and fruit trees up to the day of harvest, making it suitable for organic gardening practices. Additionally, it is versatile for indoor, outdoor, and greenhouse applications. The concentrated 1-liter bottle can make up to 50 liters of solution, offering cost-effective coverage for extensive areas. Its biodegradable and non-toxic formulation ensures safety for beneficial insects and pets when used as directed. Overall, Doktor Doom Premium 3-in-1 Crop & Plant Rescue provides a comprehensive and environmentally friendly solution for maintaining plant health.",
            "cons": "Doktor Doom Premium 3-in-1 Crop & Plant Rescue, while effective, has several drawbacks to consider. Its primary ingredient is canola oil, which, while biodegradable, can cause leaf burn if applied during high temperatures or direct sunlight. Additionally, the product's strong odor and oily residue can be off-putting for indoor use, especially in confined spaces. Some users have reported skin irritation upon contact, highlighting the importance of wearing gloves during application. Furthermore, the product's efficacy may vary depending on the severity of the pest infestation, and multiple applications might be necessary for complete control. Lastly, while it is safe for use on food crops up to the day of harvest, the lack of detailed ingredient disclosure on the label has raised concerns among some gardeners.",
            "notes": "",
            "amazonLink": "https://amzn.to/4mcgFhd",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "doktor-doom-premium-3-in-1-crop-plant-rescue"
        },
        {
            "name": "Doktor Doom Premium Insecticidal Soap",
            "chemical": "Potassium Salts of Fatty Acids",
            "image": "Insecticides/doktor-doom-insecticidal-soap.png",
            "description": "Doktor Doom Premium Insecticidal Soap is a registered pesticide in Canada, approved by Health Canada under Pest Management Regulatory Agency (PMRA) Registration Numbers 34258 and 34420. Its active ingredient, potassium salts of fatty acids, is effective against a variety of pests including aphids, mealybugs, spider mites, psyllids, pear and rose slugs (sawfly larvae), soft brown scale, and whiteflies. The product is safe for use on food crops, vegetables, and fruit trees up to the day of harvest, making it suitable for organic gardening practices. It can be applied indoors, outdoors, and in greenhouses on plants such as fruit trees, vegetables, houseplants, flowering, foliage and bedding plants, and ornamental and shade trees. Doktor Doom Premium Insecticidal Soap is available in a 1-liter concentrate that makes up to 50 liters of solution, providing cost-effective coverage for extensive areas. Its ready-to-spray hose-end applicator ensures even coverage and ease of application. For more information, you can refer to the official Health Canada PMRA database.",
            "application": "To apply Doktor Doom Premium Insecticidal Soap to your lawn, dilute the concentrate according to the label instructions, usually mixing it with water in a garden sprayer. Spray the solution evenly over the affected areas of your lawn, making sure to cover the insects directly, as it works on contact. Apply during cooler parts of the day, such as early morning or late afternoon, to avoid leaf burn. Repeat applications every 7 to 10 days as needed, and always follow safety guidelines on the product label.",
            "legality": "Doktor Doom Premium Insecticidal Soap is <b>legal</b> to use in Canada. It is a registered pesticide in Canada, approved by Health Canada's Pest Management Regulatory Agency (PMRA) under Registration Numbers 34258 and 34420.",
            "pros": "Doktor Doom Premium Insecticidal Soap offers several advantages for gardeners seeking effective pest control solutions. Its active ingredient, potassium salts of fatty acids, is a contact insecticide and miticide that targets soft-bodied pests such as aphids, mealybugs, spider mites, psyllids, pear and rose slugs (sawfly larvae), soft brown scale, and whiteflies. The product is safe for use on food crops, vegetables, and fruit trees up to the day of harvest, making it suitable for organic gardening practices. It can be applied indoors, outdoors, and in greenhouses on plants such as fruit trees, vegetables, houseplants, flowering, foliage and bedding plants, and ornamental and shade trees. Doktor Doom Premium Insecticidal Soap is available in a 1-liter concentrate that makes up to 50 liters of solution, providing cost-effective coverage for extensive areas. Its ready-to-spray hose-end applicator ensures even coverage and ease of application. For more information, you can refer to the official Health Canada PMRA database.",
            "cons": "Doktor Doom Premium Insecticidal Soap, while effective, has some drawbacks to consider. It only works on contact, so thorough coverage of pests is necessary for good results, and multiple applications may be required. The soap can sometimes cause leaf burn, especially if applied during hot, sunny weather or on sensitive plants. Additionally, it may not be effective against hard-shelled or resistant pests. Users should also take care to avoid contact with skin or eyes, as it can cause irritation.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "doktor-doom-premium-insecticidal-soap-concentrate"
        },
        {
            "name": "Green Earth Horticultural Oil Insect Spray",
            "chemical": "Mineral Oil",
            "image": "Insecticides/green-earth-horticultural-oil.png",
            "description": "Green Earth Horticultural Oil Insect Spray is a plant-based pest control solution designed to manage a variety of soft-bodied insects such as aphids, whiteflies, spider mites, and scale insects. It works by smothering insects and their eggs rather than relying on toxic chemicals, making it a more environmentally friendly and low-toxicity option for use on fruits, vegetables, flowers, and ornamental plants. This spray is typically made with mineral or vegetable oils and is suitable for organic gardening when used according to label directions. For best results, it should be applied during calm weather and when plants are not stressed by drought or extreme temperatures.",
            "application": "To apply Green Earth Horticultural Oil Insect Spray to your lawn, first ensure the weather is mild, with no rain or extreme heat expected for at least 24 hours. Mix the product according to the label instructions and apply using a garden sprayer, focusing on areas with visible insect activity. Thoroughly coat the upper and lower surfaces of grass blades and any nearby plants where pests may be hiding. Apply in the early morning or late evening to minimize the risk of leaf burn and avoid spraying when the lawn is wet or under drought stress. Repeat applications as needed, following the recommended interval on the label.",
            "legality": "Green Earth by Wilson Horticultural Oil Insect Spray is legally registered in Canada as a pest control product under Health Canada 's Pest Management Regulatory Agency (PMRA), with the registration number 21348 and an expiry date of December 31, 2025. This product contains mineral oil as its active ingredient and is approved for use as both an acaricide and insecticide when used according to the label. Federal registration by PMRA authorizes its sale, distribution, and use across Canada, but users must strictly follow the product label and comply with any additional provincial or municipal regulations that may apply, particularly in Ontario where further licensing or classification rules may govern pesticide use",
            "pros": "Green Earth Horticultural Oil Insect Spray offers several advantages for gardeners seeking effective and environmentally friendly pest control. It uses mineral oil to suffocate soft-bodied insects like aphids, mites, and scale, making it a less toxic alternative to synthetic pesticides. It is safe for use on edible plants when applied as directed, and it breaks down quickly in the environment, reducing the risk of long-term residue. Additionally, it can be used in organic gardening and is less likely to harm beneficial insects when applied carefully, especially during off-peak hours for pollinators.",
            "cons": "While Green Earth Horticultural Oil Insect Spray is a safer alternative to chemical pesticides, it does have some drawbacks. It can cause leaf burn or plant stress if applied during hot, sunny, or drought conditions. The product must make direct contact with pests to be effective, which means thorough and repeated applications may be necessary. It can also harm beneficial insects if sprayed indiscriminately. Additionally, its effectiveness is limited to soft-bodied insects, so it may not be suitable for controlling all types of lawn or garden pests.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "green-earth-horticultural-oil"
        },
        {
            "name": "Loveland Lagon 480 E",
            "chemical": "Dimethoate",
            "image": "Insecticides/loveland-lagon.png",
            "description": "LAGON 480 E is a broad-spectrum insecticide manufactured by Loveland Products Canada, renowned for its reliable performance across various environmental conditions and a wide range of crops. Its active ingredient, dimethoate (480 g/L), provides local systemic, contact, and stomach activity, effectively controlling pests such as aphids, leafhoppers, tarnished plant bugs, lygus bugs, bean beetles, and spider mites. These pests can significantly reduce plant and seed development by sucking juices and nutrients from the plant. LAGON 480 E penetrates leaf tissue, reaching the underside of leaves to eliminate aphids, offering up to 7 days of control. It remains effective under a broad temperature range, making it suitable for use during hot periods when aphids and mites are prevalent. As a Group 1B insecticide/acaricide, it plays a role in resistance management strategies. For optimal efficacy, adding LI 700 non-ionic penetrating surfactant to the spray tank is recommended, and adjusting the spray water pH to 5-6 enhances its systemic action. Registered for use on a diverse array of crops, including cereals, vegetables, berries, strawberries, asparagus, and ornamentals, LAGON 480 E is a trusted choice for comprehensive pest protection in Canadian agriculture.",
            "application": "To apply Loveland LAGON 480 E to your lawn, first mix the insecticide according to the label instructions, typically diluting it in water. Use a sprayer to evenly cover the grass, focusing on areas where pests like aphids or mites are present. It's best to apply during calm weather to avoid drift and when temperatures are moderate for optimal effectiveness. Always wear protective gear, follow safety guidelines, and avoid mowing your lawn for at least 24 hours after application to allow the product to work properly.",
            "legality": "LAGON 480 E is a registered pesticide in Canada, approved by Health Canada's Pest Management Regulatory Agency (PMRA) under registration number 9382. Manufactured by Loveland Products Canada, it contains dimethoate as its active ingredient and is classified as a Group 1B insecticide/acaricide. The product is authorized for use on various crops, including cereals, vegetables, berries, strawberries, asparagus, and ornamentals, with specific application guidelines outlined on the product label. However, it's important to note that LAGON 480 E is not approved for use in residential areas, parks, school grounds, or playing fields. Its application is restricted to certified applicators in agricultural settings, and it is prohibited for use by homeowners or uncertified users. Additionally, the product is toxic to bees; therefore, it should not be applied when bees are active or foraging in the treatment area. Always adhere to the label instructions and safety precautions when using this insecticide.",
            "pros": "Loveland LAGON 480 E is a highly effective insecticide that offers broad-spectrum control against a variety of pests like aphids, spider mites, and leafhoppers. Its triple-action formula works systemically, by contact, and through ingestion, providing thorough pest control. The product penetrates leaf tissue to reach hidden pests and offers up to seven days of residual protection. It remains effective across a wide temperature range, making it versatile for different growing conditions. Additionally, LAGON 480 E supports resistance management programs and performs even better when combined with a surfactant and proper spray water pH, making it a trusted choice for many growers.",
            "cons": "Loveland LAGON 480 E, while effective, has some drawbacks to consider. It is toxic to bees and other beneficial insects, so applications must be carefully timed to avoid harming pollinators. The product requires careful handling and use by certified applicators, limiting its availability for home or casual use. Additionally, its active ingredient, dimethoate, can pose risks to human health and the environment if not used according to label directions. Resistance can develop if overused, so it must be integrated thoughtfully into pest management programs.",
            "notes": "OnGuard Pro-Perm Insect Killer is legal for use in Canada. It is registered with Health Canada's Pest Management Regulatory Agency (PMRA) under Pest Control Product Registration Number 32333, and its registration is valid until December 31, 2025. This means the product has been assessed for safety and effectiveness, and its use is authorized within the country. However, it's important to follow the label instructions carefully, as misuse can lead to enforcement actions under the Pest Control Products Act.",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "loveland-lagon"
        },
        {
            "name": "OnGuard Pro-Perm",
            "chemical": "Permethrin",
            "image": "Insecticides/onguard-pro-perm-insect-killer.jpg",
            "description": "OnGuard Pro-Perm Insect Killer is a versatile, water-based pesticide formulated to provide long-lasting control against a wide range of pests. With an active ingredient concentration of 0.35% permethrin, it effectively targets both crawling and flying insects, including ants, bedbugs, cockroaches, fleas, spiders, ticks, and more. The product is designed for indoor and outdoor use, offering a residual effect that continues to eliminate pests for up to 60 days after application. It is particularly effective against cockroaches, providing continuous killing action for up to two months. OnGuard Pro-Perm is registered with Health Canada under Pest Control Product Registration Number 32333 and is available in a 3.78L jug. The formula includes sodium benzoate as a preservative and features a lemongrass fragrance, making it a practical choice for both residential and commercial pest control needs.",
            "application": "To apply OnGuard Pro-Perm to your lawn, first dilute the product according to the label instructions. Use a garden sprayer to evenly apply the solution across the entire lawn area, focusing on spots where pests are commonly found. Avoid spraying on windy days to prevent drift, and keep pets and children off the treated area until it has fully dried. Regular applications every few weeks can help maintain effective pest control.",
            "legality": "OnGuard Pro-Perm Insect Killer is legal for use in Canada. It is registered with Health Canada's Pest Management Regulatory Agency (PMRA) under Pest Control Product Registration Number 32333, and its registration is valid until December 31, 2025. This means the product has been assessed for safety and effectiveness, and its use is authorized within the country. However, it's important to follow the label instructions carefully, as misuse can lead to enforcement actions under the Pest Control Products Act.",
            "pros": "OnGuard Pro-Perm Insect Killer offers several advantages for those seeking effective pest control solutions. Its water-based formula with 0.35% permethrin provides long-lasting protection, effectively eliminating a wide range of pests, including ants, bedbugs, cockroaches, fleas, spiders, and ticks. The product is designed for both indoor and outdoor use, making it versatile for various applications. With a residual effect lasting up to 60 days, it ensures continuous protection against pests. Additionally, OnGuard Pro-Perm is non-flammable and has a mild lemongrass fragrance, enhancing user safety and comfort during application. Its ease of use and effectiveness make it a reliable choice for maintaining a pest-free environment.",
            "cons": "OnGuard Pro-Perm is effective but has some drawbacks. Its residual effect lasts up to 60 days but can be reduced if the treated area gets wet, requiring reapplication. It kills pests on contact but doesn't repel them, so new insects can still enter treated spaces. The product can harm beneficial insects like bees, so it must be used carefully. It may be less effective against some pests such as bedbugs, and since permethrin is toxic to cats, pets need to be kept away from treated areas. Additionally, some users feel its lower concentration may not provide the best value compared to stronger alternatives.",
            "notes": "",
            "amazonLink": "https://amzn.to/45oxGPF",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "onguard-pro-perm"
        },
        {
            "name": "OnGuard Professional P-22-RTU",
            "chemical": "Tertramethrins, Pyrethrins",
            "image": "Insecticides/onguard-professional-p-22-rtu.jpg",
            "description": "OnGuard Professional P-22-RTU is a ready-to-use residual insecticide formulated to provide effective control against a wide range of pests both indoors and outdoors. Its active ingredients, Tetramethrin (0.20%) and Permethrin (0.20%), offer rapid knockdown and extended residual activity. This product is suitable for spot and crack-and-crevice applications in residential settings, including homes, apartments, and public buildings. OnGuard P-22-RTU is effective against various pests such as ants, cockroaches, spiders, fleas, ticks, mosquitoes, flies, earwigs, silverfish, sowbugs, carpet beetles, and crickets. It is designed for use on the exterior surfaces of buildings, as well as localized areas on patios, decks, and places where insects may enter. The product should not be applied as a space spray or broadcast application; instead, it should be used as a spot or crack-and-crevice treatment. It is important to avoid application to furniture, mattresses, linens, toys, or clothing, and to ensure that treated areas are ventilated and dry before re-entry. The product is classified under the Domestic category and is registered under the Pest Control Products Act with registration number 31102. Users should always read and follow the label directions carefully to ensure safe and effective use.",
            "application": "To apply OnGuard Professional P-22-RTU to your lawn, use it as a spot treatment or for crack-and-crevice applications around the perimeter of your home and outdoor structures where insects may enter. Spray the product directly on affected areas such as patios, decks, foundation walls, and other outdoor surfaces, avoiding broad broadcast applications on the grass itself. Always follow the label instructions carefully, wear protective gear, and ensure treated areas are dry before allowing pets or children to enter. Avoid applying it directly on plants, lawns, or furniture.",
            "legality": "OnGuard Professional P-22-RTU is legally registered for use in Canada. It holds Pest Control Products Act (PCPA) registration number 31102, issued by Health Canada's Pest Management Regulatory Agency (PMRA). The product is classified as a domestic insecticide and is effective against a wide range of pests, including ants, cockroaches, spiders, fleas, ticks, mosquitoes, flies, earwigs, silverfish, sowbugs, carpet beetles, and crickets. The registration is valid until December 31, 2025, with no current re-evaluation status. Users must adhere strictly to the label instructions, as it is an offense under the PCPA to use the product in any manner not specified on the label.",
            "pros": "OnGuard Professional P-22-RTU offers several advantages for both residential and commercial pest control. Its ready-to-use formulation eliminates the need for mixing, simplifying application. The product provides residual control, effectively managing a wide range of pests, including ants, cockroaches, spiders, fleas, ticks, mosquitoes, and more. Its versatility allows for use both indoors and outdoors, targeting areas where insects are likely to enter or reside. Additionally, the product's low odor ensures minimal disruption to occupants during application. These features make OnGuard Professional P-22-RTU a practical and efficient choice for comprehensive pest management.",
            "cons": "OnGuard Professional P-22-RTU, while effective in many scenarios, has certain limitations. Its ready-to-use formulation lacks a trigger sprayer, necessitating the separate purchase of an applicator, which can be inconvenient. Additionally, the product is classified as \"harmful to pollinators,\" making it unsuitable for use during flowering periods or in areas frequented by beneficial insects. Its residual effectiveness can be compromised by rain or water contact, requiring reapplication after such events. Furthermore, the product is intended for spot treatments and localized applications, not broad-area spraying, which may limit its utility in extensive pest control needs. Lastly, while it is registered for use in Canada, users must adhere strictly to the label instructions, as misuse can lead to legal and safety concerns.",
            "notes": "",
            "amazonLink": "https://amzn.to/458F68o",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "onguard-professional-p-22-rtu"
        },
        {
            "name": "Ortho Ant B Gon MAX",
            "chemical": "Permethrin",
            "image": "Insecticides/ortho-ant-b-gon.png",
            "description": "Ortho Ant B Gon MAX is a comprehensive line of ant control products designed to eliminate ant colonies both indoors and outdoors. The product range includes liquid eliminators, granules, and ready-to-use sprays, each formulated to attract ants and destroy entire colonies, including the queen. For indoor use, the liquid bait is applied in spots or cracks and crevices, such as under sinks or along baseboards, where ants are active. Outdoors, the granules can be applied directly to ant mounds, trails, or as a perimeter treatment around structures. The ready-to-use sprays, available in various sizes including a 4L jug with a battery-powered wand applicator, are ideal for larger infestations, allowing for easy application over extensive areas. All Ortho Ant B Gon MAX products are designed to be effective in eliminating ants within 7 days when used as directed. These products are available at major retailers like The Home Depot and RONA in Canada.",
            "application": "To apply Ortho Ant B Gon MAX to your lawn, start by identifying ant trails or mounds. For granular products, sprinkle the granules directly onto the ant mounds and along trails, then lightly water the area to activate the insecticide. If using the liquid or ready-to-use spray, apply it carefully around the base of plants, along the edges of your lawn, or directly on ant nests, following the label instructions for proper dosage. Always wear gloves and avoid applying before heavy rain to ensure the product remains effective.",
            "legality": "Ortho Ant B Gon MAX products are legally registered for use in Canada. Each product in the line has been approved by Health Canada's Pest Management Regulatory Agency (PMRA), ensuring they meet safety and efficacy standards. For instance, the Ortho Ant B Gon MAX Ant Eliminator with Wand Applicator is registered under PMRA number 32226, with an expiry date of December 31, 2025. Similarly, the Ortho Ant B Gon MAX Ant Killer Granules have a registration number of 33511, valid until December 31, 2029. These products are available for purchase at major Canadian retailers like The Home Depot and RONA. Always follow the label instructions and safety precautions when using these products.",
            "pros": "Ortho Ant B Gon MAX offers several advantages for homeowners dealing with ant infestations. Its versatile product line includes granules, liquid, and ready-to-use sprays, allowing for tailored applications both indoors and outdoors. The granules are effective against various ant species, including pavement and odorous house ants, and can be applied directly to mounds or trails. The liquid and spray formulations are designed for spot treatments in cracks and crevices, providing targeted control in areas like kitchens and bathrooms. Additionally, the spray products offer the convenience of an all-angle nozzle, enabling application in hard-to-reach places. These features make Ortho Ant B Gon MAX a practical and effective solution for comprehensive ant control.",
            "cons": "Ortho Ant B Gon MAX, while effective, has some drawbacks. It may require multiple applications to fully eliminate large or well-established ant colonies. Some users find that the granules can be washed away by heavy rain if not watered in properly, reducing effectiveness. Additionally, it contains chemicals that can be harmful to beneficial insects and pets if not used carefully according to the label instructions. Lastly, certain formulations may have a noticeable odor, which some people find unpleasant.",
            "notes": "",
            "amazonLink": "https://amzn.to/4mgFt7Z",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "ortho-ant-b-gon-max"
        },
        {
            "name": "Ortho Bug B Gon ECO",
            "chemical": "Pyrethrins",
            "image": "Insecticides/ortho-bug-b-gon-eco.jpg",
            "description": "Ortho Bug B Gon ECO Insecticide is a plant-safe solution designed to combat a wide range of common indoor and greenhouse pests. Formulated with natural canola oil and pyrethrins, it effectively targets all life stages of aphids, spider mites, whiteflies, thrips, mealybugs, and scale insects. This product is available in two convenient formats: a ready-to-use spray and a concentrate that can be mixed with water for larger applications. The ready-to-use spray is ideal for quick, spot treatments, while the concentrate offers a cost-effective option for extensive infestations, making up to 25 liters of solution from a 500 mL bottle. Both formulations are safe for use on houseplants and greenhouse ornamentals, including fuchsia and roses, and can be applied up to one day before harvest on edible crops. For optimal results, apply when pests or damage are visible, ensuring thorough coverage without causing runoff. Always follow label instructions and conduct a patch test on sensitive plants before full application.",
            "application": "To apply Ortho Bug B Gon ECO to your lawn, first choose either the ready-to-use spray for small areas or dilute the concentrate according to the label instructions for larger lawns. Spray evenly over the affected grass, targeting areas where pests are visible. Apply when temperatures are cooler, such as early morning or late afternoon, to avoid harming beneficial insects and prevent rapid evaporation. Make sure to cover both the tops and undersides of grass blades for best results. Avoid applying before rain to prevent washing away the treatment, and always follow the product's safety guidelines.",
            "legality": "In Canada, the legality of Ortho Bug B Gon ECO products varies by formulation and province. Certain products within the Ortho Bug B Gon ECO line have been registered with Health Canada and are legal for use in Canada. For instance, the Ortho Bug B Gon ECO Insecticide Concentrate and Ready-to-Use sprays, containing pyrethrins as the active ingredient, are registered and approved for sale and use in Canada. However, some other formulations, such as those containing potassium salts of fatty acids, have been cancelled and are no longer approved for sale or use in Canada. Additionally, availability may be restricted in certain provinces. For example, the Ortho Bug B Gon ECO Insecticide Concentrate is not available in Ontario due to local regulations. Therefore, it's essential to check the specific product's registration status and local regulations before purchasing or using any Ortho Bug B Gon ECO product in Canada.",
            "pros": "Ortho Bug B Gon ECO offers several advantages for gardeners seeking effective and eco-friendly pest control. Its active ingredients (pyrethrins and canola oil) are derived from natural sources, making it a safer option for use around pets, children, and beneficial insects when applied as directed. The product effectively targets a wide range of pests, including aphids, spider mites, whiteflies, mealybugs, and scale insects, in all life stages. It is versatile, suitable for both indoor and outdoor applications, and can be used on edible crops up to the day of harvest. Additionally, Ortho Bug B Gon ECO is available in ready-to-use and concentrate forms, offering flexibility for various gardening needs. Its formulation is free from piperonyl butoxide, a common synergist in many insecticides, which some gardeners prefer to avoid. Overall, Ortho Bug B Gon ECO provides an effective, user-friendly, and environmentally conscious solution for managing common garden pests.",
            "cons": "While Ortho Bug B Gon ECO offers several benefits, it's important to consider its limitations. Some users have reported that the product may cause damage to certain plants, especially if applied during high temperatures or if the plants are stressed. For instance, a review on Home Depot's website mentioned that the product killed plants when applied to a garden. Additionally, the product may not be effective against all pests, as some users have found it ineffective against specific infestations like mealybugs on hibiscus. Another consideration is the necessity to apply the product during cooler parts of the day and avoid rain, which can limit the timing and conditions under which it can be used effectively. Lastly, while the product is labeled as eco-friendly, it still contains active ingredients that may pose risks to beneficial insects and aquatic life if not used according to instructions. Therefore, it's crucial to follow all label directions carefully to minimize any potential negative impacts.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "ortho-bug-b-gon-eco"
        },
        {
            "name": "Ortho Bug B Gon ECO Insecticidal Soap",
            "chemical": "Potassium Salts of Fatty Acids",
            "image": "Insecticides/ortho-bug-b-gon-eco-soap.jpg",
            "description": "Ortho Bug B Gon ECO Insecticidal Soap is an effective, eco-friendly pest control solution designed for both indoor and outdoor use. Formulated with potassium salts of fatty acids, it targets soft-bodied insects such as aphids, mealybugs, spider mites, and whiteflies by disrupting their cell membranes, leading to dehydration and death upon contact. This product is safe for use on a wide range of plants, including ornamentals, houseplants, trees, and edible crops, up to and including the day of harvest. Available in both ready-to-use and concentrate forms, it offers versatility for various gardening needs. For optimal results, it's recommended to apply the soap early in the morning or during overcast conditions to minimize potential plant stress. This insecticidal soap provides a practical and environmentally conscious option for gardeners seeking to manage pest infestations effectively.",
            "application": "To apply Ortho Bug B Gon ECO Insecticidal Soap on your lawn, first dilute the concentrate according to the label instructions or use the ready-to-use spray directly. Spray the affected areas thoroughly, ensuring good coverage of the grass blades and any visible pests. It's best to apply early in the morning or late in the afternoon to avoid direct sunlight, which can cause leaf burn. Repeat applications may be needed every 7 to 10 days until the pest problem is under control. Avoid applying when rain is expected within 24 hours to ensure effectiveness.",
            "legality": "Ortho Bug B Gon ECO Insecticidal Soap is legally registered for use in Canada. Health Canada's Pest Management Regulatory Agency (PMRA) has approved multiple formulations of this product, including both ready-to-use and concentrate versions containing potassium salts of fatty acids as the active ingredient. These products are registered under the following numbers: 28376 (ready-to-use), 28377 (concentrate), and 29272 (ready-to-spray concentrate), with expiration dates ranging from 2025 to 2029. However, it's important to note that certain formulations, such as the ready-to-use with wand applicator (registration number 30915) and ready-to-use with quick connect sprayer (registration number 29271), have been cancelled as of November 1, 2023. Therefore, while most Ortho Bug B Gon ECO Insecticidal Soap products are legally available in Canada, consumers should ensure they are purchasing current, registered formulations and verify local regulations, as availability may vary by province.",
            "pros": "Ortho Bug B Gon ECO Insecticidal Soap offers several advantages for gardeners seeking effective pest control. Its active ingredient, potassium salts of fatty acids, targets pests like aphids, mealybugs, spider mites, and whiteflies by disrupting their cell membranes, leading to dehydration and death upon contact. This mode of action ensures rapid results without leaving harmful residues, making it safe for edible crops up to and including the day of harvest. The product is versatile, suitable for use on a wide range of plants, including houseplants, vegetables, and ornamental trees, both indoors and outdoors. Additionally, it is easy to apply, available in ready-to-use and concentrate forms, and can be applied using various sprayers, including hose-end attachments. These features make Ortho Bug B Gon ECO Insecticidal Soap a practical choice for environmentally conscious gardeners aiming to manage pest infestations effectively.",
            "cons": "Ortho Bug B Gon ECO Insecticidal Soap, while effective, has some drawbacks. It only works on direct contact with soft-bodied pests, so thorough coverage is essential, which can be time-consuming. It may need repeated applications for persistent infestations. Additionally, it can cause leaf burn or plant stress if applied in hot, sunny conditions or to sensitive plants. It is less effective against hard-bodied insects or pests protected by waxy coatings. Finally, because it kills beneficial insects on contact as well, care must be taken to avoid harming pollinators and natural predators.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "ortho-bug-b-gon-eco-soap"
        },
        {
            "name": "Ortho Home Defense",
            "chemical": "Bifenthrin, Zeta-Cypermethrin",
            "image": "Insecticides/ortho-home-defense.png",
            "description": "Ortho Home Defense is a widely recognized insect control solution designed to protect homes from a variety of pests. Its formula effectively targets over 130 insects, including ants, cockroaches, spiders, fleas, ticks, and mosquitoes, making it suitable for both indoor and outdoor use. The product features an odorless, non-staining formula that dries quickly, allowing treated areas to be safely re-entered soon after application. Many users appreciate its ease of use, especially when paired with the Comfort Wand applicator, which offers continuous spray without the need for pumping. Additionally, Ortho Home Defense provides long-lasting protection, with some formulations offering up to 12 months of pest control on non-porous indoor surfaces. This combination of effectiveness, convenience, and extended coverage makes Ortho Home Defense a popular choice for homeowners seeking reliable pest management.",
            "application": "To apply Ortho Home Defense Insect Killer for Lawn & Landscape, connect the included hose-end sprayer to your garden hose and turn on the water. Shake the bottle well before attaching. Spray evenly across your lawn, ensuring the grass is slightly wet without causing runoff. For perimeter treatments, spray the foundation up to a height of 2 feet and extend a 2-foot band around the house. This product covers approximately 5,300 square feet for lawn treatment. After application, people and pets can re-enter the area once the spray has dried. For best results, apply when insect activity is first noticed.",
            "legality": "Ortho Home Defense products are subject to Canadian regulations under the Pest Control Products Act (PCPA), which mandates that all pest control products sold or used in Canada must be registered with Health Canada. This ensures that the products have been assessed for safety and effectiveness. Some Ortho Home Defense products, such as the \"Ortho Home Defense Max No-Pest Insecticide Strip\" (Registration No. 22027), have been registered in Canada and are legally available for use. However, other products, like certain insecticide aerosols and strips, have been cancelled or are not registered for sale in Canada. It's essential to verify the registration status of any Ortho product before purchasing or using it in Canada. You can do this by checking the Pest Control Product registration number on the product label or consulting Health Canada's Pesticide Product Information Database. Using unregistered products is illegal and may pose health and environmental risks.",
            "pros": "Ortho Home Defense offers several advantages for homeowners seeking effective pest control solutions. Its active ingredients, such as bifenthrin and zeta-cypermethrin, provide long-lasting protection by creating a barrier that kills and repels a wide range of pests, including ants, cockroaches, spiders, fleas, and ticks. The product is designed for both indoor and outdoor use, making it versatile for various applications. Additionally, Ortho Home Defense is formulated to dry quickly, leaving no visible residue or lingering odor, which is particularly beneficial for households with children and pets. The inclusion of a Comfort Wand or battery-operated sprayer enhances ease of application, allowing users to treat hard-to-reach areas without bending or pumping. Overall, Ortho Home Defense provides an efficient and user-friendly option for maintaining a pest-free environment.",
            "cons": "While Ortho Home Defense is a popular choice for pest control, it has several drawbacks that users should consider. One common issue is the product's tendency to stain surfaces; users have reported unsightly marks on siding and windows that are difficult to remove. Additionally, some customers have found the sprayer to be prone to malfunction, with components cracking or failing to function properly after repeated use. Effectiveness can also vary; while it may kill adult insects, it doesn't eliminate eggs, leading to recurring infestations unless reapplications are made every 1-2 weeks. Moreover, the product's active ingredient, bifenthrin, can be toxic to aquatic life, necessitating careful application away from water sources. Lastly, some users have reported that certain pests, like bed bugs and maggots, are not effectively controlled with this product, even when applied directly. These factors suggest that while Ortho Home Defense can be effective, it may not be suitable for all situations or users.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "ortho-home-defense"
        },
        {
            "name": "Ortho Slug B Gon ECO",
            "chemical": "Iron Phosphate",
            "image": "Insecticides/ortho-slug-b-gon-eco.png",
            "description": "Ortho Slug B Gon ECO is a granular slug and snail bait designed for gardeners seeking an effective and environmentally conscious solution. It features a palatable attractant that stops slugs and snails from feeding when consumed, with pests eliminated within 3-6 days, while uneaten granules biodegrade into the soil, providing up to two weeks of protection for flowers, shrubs, fruits, berries and vegetables. Easy evening application is recommended, just scatter a barrier around vulnerable plants. Available in 500 g and 1 kg sizes, the bait remains solid when wet and is considered pet and wildlife-safe when used according to directions. It provides a reliable, low-maintenance option for protecting garden beds, whether used reactively or preventatively, especially during damp, slug-prone periods.",
            "application": "To apply Ortho Slug B Gon ECO to your lawn, evenly scatter the granules by hand or with a spreader around areas where slugs and snails are active, especially near garden beds, flower borders, or damp, shady spots. Focus on creating a light barrier around plants or along lawn edges where pests typically enter. Apply in the evening when slugs are most active, and reapply after heavy rain or every two weeks for continued protection. There's no need to water in, and unused granules will naturally degrade into the soil.",
            "legality": "In Canada, Ortho Slug B Gon ECO Slug and Snail Bait is legally registered by Health Canada under registration number 28375. It contains ferric phosphate as its active ingredient and is classified as a molluscicide/insecticide. Its registration was valid until December 31, 2024. ",
            "pros": "Ortho Slug B Gon ECO offers several advantages for gardeners looking to control slugs and snails safely and effectively. Its active ingredient, ferric phosphate, is a naturally occurring compound that poses minimal risk to pets, wildlife, and beneficial insects when used as directed. The bait is weather-resistant, remaining effective even after rainfall, and it breaks down naturally into the soil if not consumed. Additionally, it stops pests from feeding immediately, helping to protect plants quickly, and provides up to two weeks of control with a single application.",
            "cons": "While Ortho Slug B Gon ECO is a safer alternative to traditional slug baits, it does have some drawbacks. Its effectiveness can vary depending on the level of infestation, and multiple applications may be needed for ongoing control, especially in heavily infested areas. The bait must be applied directly where slugs are active, so it requires careful placement and monitoring. Additionally, while it is rain-resistant, heavy downpours can still reduce its longevity, and it may not be as fast-acting as chemical alternatives like metaldehyde.",
            "notes": "",
            "amazonLink": "https://amzn.to/4lQ8Uhq",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "ortho-slug-b-gon-eco"
        },
        {
            "name": "Puroguard The Exterminator Professional PY-42",
            "chemical": "Pyrethrins, Piperonyl Butoxide",
            "image": "Insecticides/puroguard-the-exterminator-professional-py-42.jpg",
            "description": "Puroguard The Exterminator Professional PY-42 is a Canadian-made, professional-grade ready-to-use insecticide spray ideal for both indoor and outdoor applications. Engineered with a potent mix of pyrethrins and piperonyl butoxide (PBO), it delivers strong knockdown power against a broad range of flying (flies, mosquitoes, wasps, gnats, moths) and crawling pests (ants, spiders, cockroaches, beetles, bed bugs). The convenient formulation requires no dilution, simply spray onto infested areas for immediate effect. It comes in both 1 L and 4 L formats, and is labeled for domestic use, making it accessible to homeowners while retaining professional efficacy. With its dual-action blend, PY-42 offers reliable comprehensive pest control for homes, gardens, storage spaces, or any area plagued by insect infestations.",
            "application": "To apply Puroguard The Exterminator Professional PY-42 to your lawn, start by giving it a light mow and removing any debris so the chemical reaches the grass and soil. With the spray bottle held upright, evenly mist the lawn surface until it appears slightly damp,don't soak it. Focus on edge areas where pests congregate, such as around flower beds, trees, and foundation lines. Because it's a ready-to-use formula, there's no mixing required,just aim, spray evenly, and allow it to dry before allowing foot traffic or pets back on the treated area",
            "legality": "Puroguard The Exterminator Professional PY-42 is a registered pesticide in Canada under Health Canada's Pest Management Regulatory Agency (PMRA). The product is registered with the number 23356 and contains active ingredients such as piperonyl butoxide and pyrethrins. It is classified as a domestic pesticide, meaning it is intended for use in and around homes. The registration status is currently active, but it is set to expire on January 28, 2025. After this date, if the registration is not renewed, the product would no longer be legally available for sale or use in Canada.",
            "pros": "Puroguard The Exterminator Professional PY-42 offers several key benefits. It is effective against a wide range of pests both indoors and outdoors, including ants, spiders, mosquitoes, and cockroaches. The ready-to-use formula requires no mixing, making it easy and convenient to apply. Its professional-grade ingredients deliver strong and fast knockdown power, while still being safe for use in domestic environments. These qualities make PY-42 a reliable and user-friendly option for homeowners seeking effective pest control.",
            "cons": "Despite its effectiveness, Puroguard The Exterminator Professional PY-42 has some limitations. Some users have reported that it may not be as effective against certain pests, such as spiders, with one reviewer noting that spiders returned within a couple of days after application. Additionally, the product's registration is set to expire on January 28, 2025, and if not renewed, it would no longer be legally available for sale or use in Canada. These factors may affect its suitability for long-term pest control needs.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "puroguard-the-exterminator-professional-py-42"
        },
        {
            "name": "Safer's 3 in 1 Garden Spray",
            "chemical": "Potassium Salts of Fatty Acids",
            "image": "Insecticides/safers-3-in-1.png",
            "description": "Safer's 3 in 1 Garden Spray is a highly effective and multifunctional product designed to provide comprehensive care for a wide variety of plants. By combining insecticide, fungicide, and miticide properties in one easy-to-use spray, it helps gardeners tackle multiple common garden problems simultaneously. This all-in-one formula controls a broad range of pests such as aphids, whiteflies, and spider mites, while also preventing and treating fungal diseases including powdery mildew, black spot, and rust. Suitable for use on vegetables, fruits, flowers, shrubs, and ornamental plants, Safer's 3 in 1 Garden Spray supports healthy plant growth and improves overall garden vitality. Its ready-to-use formula makes it simple to apply, saving time and effort by eliminating the need for multiple separate products. Additionally, the spray is formulated to be gentle on beneficial insects and the environment when used as directed, making it a smart choice for gardeners who want effective pest and disease control without harsh chemicals. Whether you are a novice or an experienced gardener, Safer's 3 in 1 Garden Spray offers a reliable and convenient solution to protect your plants and keep your garden thriving throughout the growing season.",
            "application": "To apply Safer's 3 in 1 Garden Spray on your lawn, first shake the bottle well. Hold the spray nozzle about 12 to 18 inches away from the grass and evenly spray the affected areas until they are thoroughly wet but not dripping. It's best to apply the spray during calm weather to avoid drift and in the early morning or late afternoon to prevent leaf burn from the sun. Repeat applications every 7 to 14 days as needed, following the instructions on the label for the best results and safe use.",
            "legality": "Safer's 3-in-1 Garden Spray is a registered and legal pest control product in Canada. It is registered with Health Canada's Pest Management Regulatory Agency (PMRA), which ensures that pest control products sold in Canada meet strict safety and efficacy standards. This product is formulated with potassium salts of fatty acids and sulfur, and is compliant with Canadian Organic Standards, making it suitable for organic gardening. It is available for purchase at various retailers across Canada, including The Home Depot Canada and RONA.",
            "pros": "Safer's 3-in-1 Garden Spray offers several advantages for gardeners seeking effective and convenient plant protection. Its all-in-one formulation combines a fungicide, insecticide, and miticide, allowing users to tackle multiple garden issues with a single product. The spray effectively controls a broad spectrum of pests, including aphids, mealybugs, spider mites, and whiteflies, as well as fungal diseases like powdery mildew, black spot, and rust. Its gentle composition, featuring potassium salts of fatty acids and sulfur, is safe for most plants and can be used up until the day before harvest. Additionally, the product is OMRI-listed, making it compliant with organic gardening standards. The ready-to-use spray bottle ensures ease of application, and the product is widely available across Canada, including retailers such as The Home Depot Canada and RONA.",
            "cons": "While Safer's 3 in 1 Garden Spray offers many benefits, it does have some drawbacks. Because it is a broad-spectrum product, it may also affect beneficial insects like bees and ladybugs if not applied carefully. It typically requires multiple applications for full effectiveness, which can be time-consuming. Additionally, the spray is less effective against certain stubborn pests or severe fungal infections compared to specialized treatments. Some users may also find the scent of the spray strong or unpleasant. Finally, it is important to follow safety guidelines closely to avoid potential plant damage or irritation.",
            "notes": "",
            "amazonLink": "https://amzn.to/4orsNx5",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "safers-3-in-1"
        },
        {
            "name": "Safer's End ALL",
            "chemical": "Potassium Salts of Fatty Acids, Pyrethrins",
            "image": "Insecticides/safers-end-all.png",
            "description": "Safer's End-All is a versatile insecticide, miticide, and acaricide designed to control a broad spectrum of pests across all life stages (eggs, larvae, and adults). Its active ingredients include potassium salts of fatty acids and pyrethrins, which are derived from natural sources and act quickly upon contact to eliminate pests such as aphids, whiteflies, spider mites, mealybugs, caterpillars, beetles, and chinch bugs. This product is suitable for use on a variety of plants, including ornamentals, trees, shrubs, fruit and vegetable crops, flowers, and houseplants. It can be applied up to the day before harvest, making it a convenient choice for gardeners seeking effective pest control without long waiting periods. Available in both ready-to-use and concentrate formulations, Safer's End-All offers flexibility to meet different gardening needs. Its natural composition and fast-acting formula make it a popular option for those looking to manage garden pests effectively.",
            "application": "To apply Safer's End ALL to your lawn, first shake the bottle well and dilute the product according to the label instructions. Use a garden sprayer to evenly coat the grass and any affected plants with the solution, making sure to cover both the tops and undersides of the leaves where pests and fungi often hide. Apply in the early morning or late afternoon to avoid the hottest part of the day, and repeat as needed every 7 to 14 days for effective control. Always follow the safety guidelines on the label for best results.",
            "legality": "Safer's End-All is a legal and registered pesticide in Canada. The product is approved by Health Canada and is listed in the Pest Management Regulatory Agency's (PMRA) database under Registration Numbers 22299 and 22300. These registrations are valid until December 31, 2026, indicating that the product complies with Canadian regulations for domestic use. Safer's End-All is formulated with active ingredients such as potassium salts of fatty acids and pyrethrins, which are permitted under Canada's Organic Standards. This makes it suitable for organic gardening practices.",
            "pros": "Safer's End-All offers several advantages for gardeners seeking effective pest control. Its triple-action formula, acting as a miticide, insecticide, and acaricide, targets all life stages of common pests, including aphids, whiteflies, spider mites, mealybugs, and caterpillars. This versatility eliminates the need for multiple products, simplifying pest management. The active ingredients, potassium salts of fatty acids and pyrethrins, are derived from natural sources, making it a safer choice for use around children, pets, and beneficial insects when applied as directed. Additionally, Safer's End-All can be used up to the day before harvest on edible plants, providing flexibility for gardeners. Its fast-acting nature ensures prompt results, and its biodegradable composition aligns with environmentally conscious gardening practices. ",
            "cons": "While Safer's End-All is a versatile and effective pest control solution, it does have some limitations. Its fast-acting nature means that its effects are short-lived, often requiring reapplication every 10 to 14 days, which can be labor-intensive for gardeners. Additionally, the product's strong odor may be off-putting to some users. It's also important to note that Safer's End-All is not effective against all pests; for instance, it does not specifically target or kill fungal gnats. Furthermore, while it is generally safe for many beneficial insects, it has not been specifically tested on certain species, such as ladybugs, so its impact on them remains uncertain. Lastly, the product should not be applied in direct sunlight or windy conditions to avoid potential plant damage.",
            "notes": "",
            "amazonLink": "https://amzn.to/3IPl9Mq",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "safers-end-all"
        },
        {
            "name": "Safer's Insecticidal Soap",
            "chemical": "Potassium Salts of Fatty Acids",
            "image": "Insecticides/safers-insect-soap.jpg",
            "description": "Safer's Insecticidal Soap is a widely used, environmentally friendly pest control product designed to manage a variety of soft-bodied insects, including aphids, whiteflies, spider mites, thrips, and mealybugs. Its active ingredient, potassium salts of fatty acids, works by penetrating and breaking down the insect's protective outer layer, leading to dehydration and death upon contact. This mode of action makes it an effective, non-toxic alternative to synthetic insecticides, appealing to organic gardeners and those seeking safer pest control methods. Safer's Insecticidal Soap is biodegradable and breaks down quickly in the environment, reducing the risk of harmful residue buildup. It is safe for use on a wide range of plants, including vegetables, fruits, flowers, ornamentals, and houseplants, provided the instructions are followed carefully. Additionally, it is gentle on most beneficial insects such as pollinators and predatory bugs when applied correctly, helping maintain a healthy garden ecosystem. Its ease of use, combined with its broad effectiveness, makes Safer's Insecticidal Soap a trusted choice for gardeners aiming to protect their plants while minimizing environmental impact.",
            "application": "To apply Safer's Insecticidal Soap to your lawn, dilute the concentrate according to the label instructions or use the ready-to-use formula. Use a garden sprayer to evenly coat the grass blades and any affected areas, focusing on spots where pests are visible. Apply in the early morning or late afternoon to avoid the heat of the day, which can cause damage to the grass. Repeat applications every 7 to 10 days as needed to keep pest populations under control, and always follow safety guidelines to protect beneficial insects and avoid overuse.",
            "legality": "Safer's Insecticidal Soap is a legal and registered pesticide in Canada. The product is approved by Health Canada and is listed in the Pest Management Regulatory Agency's (PMRA) database under Registration Numbers 22208 and 14669. These registrations are valid until December 31, 2026, indicating that the product complies with Canadian regulations for domestic use. Additionally, Safer's Insecticidal Soap is recognized as potentially organic, as it meets Canadian Organic Standards and has earned the EcoCert label. This certification ensures that the product's ingredients and manufacturing processes align with organic farming practices, making it a suitable choice for organic gardeners seeking effective pest control solutions.",
            "pros": "Safer's Insecticidal Soap offers several benefits for gardeners seeking a safe and effective way to control pests. Its natural, biodegradable ingredients make it environmentally friendly and gentle on beneficial insects like bees and ladybugs when used properly. It works quickly by targeting soft-bodied pests such as aphids, spider mites, and whiteflies, providing fast relief from infestations. Additionally, it is safe to use on a wide variety of plants, including vegetables, fruits, flowers, and houseplants. Safer's Insecticidal Soap is also approved for organic gardening, making it a popular choice for those looking to avoid synthetic chemicals.",
            "cons": "While Safer's Insecticidal Soap is effective and environmentally friendly, it does have some drawbacks. It only works on direct contact with soft-bodied pests, so thorough coverage is essential, which can be time-consuming. The soap may also cause damage to sensitive plants if applied in hot, sunny conditions or if used excessively. Additionally, it is less effective against hard-bodied insects and does not provide long-lasting residual control, meaning repeated applications are often necessary to keep pests at bay.",
            "notes": "",
            "amazonLink": "https://amzn.to/4fb6XcD",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "safers-insecticidal-soap"
        },
        {
            "name": "Safer's Slug & Snail Killer",
            "chemical": "Sodium Ferric EDTA",
            "image": "Insecticides/safers-slug-snail-killer.png",
            "description": "Safer's Slug & Snail Killer is an effective and eco-friendly solution for controlling slugs and snails in your garden. Utilizing sodium ferric EDTA as its active ingredient, this product works by causing dehydration in these pests, leading to their demise. The bait is highly attractive to slugs and snails, ensuring they consume it readily. It can be applied to over 40 types of plants, including vegetables, fruits, and ornamental plants, making it versatile for various gardening needs. The product remains effective for up to 14 days, even after rain or watering, and is safe to use around pets and wildlife when applied as directed. Safer's Slug & Snail Killer is available in resealable bags, ensuring convenient storage and application. Its formulation is compliant with Canadian organic standards, providing gardeners with a natural alternative to synthetic pesticides. ",
            "application": "To apply Safer's Slug & Snail Killer to your lawn, first identify areas where slugs and snails are active, such as damp, shaded spots or near plants showing damage. Spread the bait evenly around these areas, avoiding piles or heavy concentrations to ensure pests are attracted and consume it. Apply the product in the evening or early morning when slugs and snails are most active for best results. The bait remains effective for up to 14 days, even after rain or watering, so reapplication is only necessary if pest activity continues. Always follow the label instructions and keep the bait away from children, pets, and beneficial wildlife.",
            "legality": "Safer's Slug & Snail Killer is a legally registered pesticide in Canada. It holds two active registrations with Health Canada's Pest Management Regulatory Agency (PMRA): Registration No. 28774 and Registration No. 28775, both valid until December 31, 2025. These registrations ensure the product has been evaluated for safety and effectiveness under the Pest Control Products Act. Safer's Slug & Snail Killer is approved for use on various crops and ornamental plants, including lawns, and complies with Canadian organic standards. Consumers can verify its registration status and access the full product label through Health Canada's Pesticide Label Search Database.",
            "pros": "Safer's Slug & Snail Killer offers several advantages for gardeners seeking effective and environmentally friendly pest control. Its active ingredient, sodium ferric EDTA, works by causing dehydration in slugs and snails, leading to their elimination without leaving behind visible slime trails. The bait is highly attractive to these pests, ensuring they consume it readily. It remains effective for up to 14 days, even after rain or watering, providing long-lasting protection for your plants. The product is safe for use around pets and wildlife when applied as directed, making it suitable for various garden settings. Additionally, Safer's Slug & Snail Killer can be applied to over 40 types of plants, including vegetables, fruits, and ornamental plants, offering versatility for diverse gardening needs. Its easy-to-apply granules come in a resealable bag, ensuring convenient storage and application. Overall, Safer's Slug & Snail Killer combines effectiveness, safety, and convenience, making it a valuable tool for gardeners aiming to protect their plants from these common pests.",
            "cons": "Safer's Slug & Snail Killer, while effective, has some drawbacks. It primarily targets slugs and snails, so it won't control other types of garden pests, which may require additional treatments. The bait needs to be applied carefully to avoid accidental ingestion by pets or wildlife, despite being generally safe when used as directed. In some cases, heavy rain or excessive watering might reduce its effectiveness faster than expected, requiring more frequent reapplications. Additionally, some gardeners may find that it takes a few days for results to become noticeable, so patience is needed when using this product.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "safers-slug-snail-killer"
        },
        {
            "name": "Safer's Trounce",
            "chemical": "Potassium Salts of Fatty Acids, Pyrethrins",
            "image": "Insecticides/safers-trounce.jpg",
            "description": "Safer's Trounce is a versatile insecticide designed for both home gardeners and turf managers in Canada. It combines two active ingredients (pyrethrins and potassium salts of fatty acids) to effectively control a wide range of pests. Pyrethrins disrupt the nervous system of insects, while potassium salts weaken their protective outer shells. This dual-action approach ensures rapid knockdown of pests such as aphids, whiteflies, mealybugs, spider mites, scale insects, mosquitoes, ticks, chinch bugs, ants, and earwigs. Safer's Trounce is available in various formulations to suit different application needs. The ready-to-use spray (1L) is ideal for spot treatments on fruit trees, vegetables, ornamental plants, and shrubs. The hose-end concentrate (1L) is designed for larger areas like lawns and turf, providing coverage for approximately 140-420 square meters, depending on the severity of the pest problem. Both formulations are safe for use up to the day of harvest, making them suitable for organic gardening practices. Additionally, they are non-toxic to pets, birds, and earthworms when used as directed.",
            "application": "To apply Safer's Trounce to your lawn, first choose the appropriate formulation, either the ready-to-use spray for spot treatments or the hose-end concentrate for larger areas. For the hose-end concentrate, attach it to your garden hose and spray evenly across the lawn, ensuring thorough coverage, especially in areas with visible pest activity. Apply during cooler parts of the day, such as early morning or late afternoon, to avoid heat stress on the grass. Repeat applications every 7 to 14 days as needed, following the label instructions carefully to protect beneficial insects and avoid overuse.",
            "legality": "Safer's Trounce is a legally registered pesticide in Canada, approved by Health Canada's Pest Management Regulatory Agency (PMRA). It is registered under multiple product labels, including: Safer's Trounce Hose-End Lawn & Turf Insecticide (Registration No. 28680), Safer's Trounce Insecticide Concentrate (Registration No. 24363), and Safer's Trounce Yard & Garden Insecticide (Registration No. 20563). These registrations confirm that Safer's Trounce has been evaluated for safety and effectiveness when used as directed. The product is approved for use on various crops and ornamental plants, including lawns, and complies with Canadian organic standards. Consumers can verify its registration status and access the full product label through Health Canada's Pesticide Label Search Database.",
            "pros": "Safer's Trounce offers several benefits for gardeners seeking effective pest control. Its dual-action formulation combines pyrethrins, which disrupt the nervous system of insects, and potassium salts of fatty acids, which weaken their protective outer shells. This combination ensures rapid knockdown of pests such as aphids, whiteflies, spider mites, mealybugs, and scale insects. The product is gentle on plants, making it suitable for use on a variety of crops, including fruits, vegetables, and ornamentals. Additionally, Safer's Trounce can be applied up to the day of harvest, providing flexibility for gardeners. Its ready-to-use spray formulation simplifies application, and it is safe for beneficial insects like bees and earthworms when used as directed. Overall, Safer's Trounce is an effective and user-friendly option for managing common garden pests.",
            "cons": "While Safer's Trounce is effective against many common garden pests, it has some limitations. Its active ingredient, pyrethrins, breaks down quickly in sunlight, so applications may need to be repeated frequently to maintain control. The product requires thorough coverage to be effective, which can be time-consuming for larger areas. Additionally, although it is generally safe for beneficial insects when used correctly, improper use or overapplication may harm pollinators and other beneficial organisms. Lastly, it is not effective against all types of pests, so additional treatments may be necessary for certain infestations.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "safers-trounce-yard-garden"
        },
        {
            "name": "Scotts Grub B-Gon MAX",
            "chemical": "Bacillus thuringiensis",
            "image": "Insecticides/scotts-grub-b-gon-max.jpg",
            "description": "Scotts Grub B Gon MAX is a granular biological insecticide made for lawn grub control, featuring the active ingredient Bacillus thuringiensis subsp. galleriae strain SDS-502 (Bt), a naturally occurring soil bacterium that is toxic specifically to beetle larvae upon ingestion. It targets a wide range of white grubs including Japanese beetle, European chafer, June beetles, Asiatic garden beetle, and others, helping prevent the browning and thinning of turf caused by root damage. Best applied in spring (April-May), mid-summer (late June-August), or late summer to early fall (August-September), this timing aligns with peak larval activity for both preventative and curative applications. After spreading the granules using a lawn spreader, it must be watered in (about 1.25 cm of water) to activate the bacteria and move it into the soil root zone. While generally effective when applied as directed, some users on forums report that poorly timed applications or using stale product (older than 17 months post-manufacture) can reduce effectiveness. ",
            "application": "To apply Scotts Grub B Gon MAX to your lawn, use a broadcast or drop spreader to distribute the granules evenly over the affected area, following the recommended application rate on the label. It's best to apply during spring, summer, or early fall, ideally when grubs are actively feeding near the root zone. After spreading, water the lawn thoroughly with about 1.25 cm of water to help the active ingredient, Bacillus thuringiensis subsp. galleriae, move into the soil where grubs are present. For best results, apply to moist soil and avoid mowing immediately after application. Keep children and pets off the treated area until the product has been watered in and the lawn is dry.",
            "legality": "Scotts Grub B Gon MAX Grub Killer is legally registered for use in Canada. According to Health Canada's Pest Management Regulatory Agency (PMRA), it is listed under Registration Number 33460 and remains registered through December 31, 2025, confirming its compliance with Canadian safety and efficacy regulations. The active ingredient, Bacillus thuringiensis subsp. galleriae strain SDS-502, has been evaluated and approved as safe for use on lawns under the Pest Control Products Act. Availability may vary by province: for example, some provinces restrict its sale online or entirely,as noted in New Brunswick, where consumer sales of grub control products like Grub B Gon have been disallowed",
            "pros": "Scotts Grub B Gon MAX offers a number of advantages for homeowners dealing with lawn-damaging grubs. Its active ingredient, Bacillus thuringiensis subsp. galleriae, is a naturally occurring bacterium that specifically targets grub larvae without harming beneficial insects, pets, or the surrounding environment. This makes it a safer alternative to traditional chemical pesticides. It's effective against a wide variety of beetle grubs, including Japanese beetles and European chafers, and can be applied during spring, summer, or fall for both preventative and curative treatment.",
            "cons": "Despite its benefits, Scotts Grub B Gon MAX has a few drawbacks. It requires watering after application to activate the ingredient, which may be inconvenient during dry spells or in areas with watering restrictions. Its effectiveness can vary depending on the timing of application, if applied too early or too late in the grub life cycle, results may be limited. Additionally, because it relies on ingestion by the grubs, results may take several days to become noticeable. In some regions, availability is limited due to provincial pesticide regulations, and the product tends to be more expensive than synthetic alternatives.",
            "notes": "",
            "amazonLink": "https://amzn.to/44OQWFY",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "scotts-grub-b-gon-max"
        },
        {
            "name": "Superior Control Products Spider and Insect Destroyer",
            "chemical": "Permethrin",
            "image": "Insecticides/superior-control-products-spider-insect-destroyer.png",
            "description": "Superior Control Product Spider and Insect Destroyer is a versatile insecticide designed to control a wide range of crawling pests, including spiders, ants, earwigs, fleas, and cockroaches. Formulated with permethrin as its active ingredient, this product is available in various concentrations and sizes, such as a 500 mL concentrate at 12.5 g/L and a 1L ready-to-use solution with 0.25% permethrin. It is suitable for both indoor and outdoor applications, effectively treating areas like building exteriors, patios, decks, and ornamental plants. The product offers residual protection, with indoor use lasting up to 90 days and outdoor use up to 60 days, depending on environmental conditions. Its ready-to-use liquid form simplifies application, making it a convenient choice for homeowners seeking effective pest control solutions.",
            "application": "Superior Control Products Spider and Insect Destroyer is not intended for application directly on lawns or turf. It is formulated as a concentrated permethrin spray (12.5 g/L) for use on building exteriors, patios, decks, and ornamentals, targeting crawling insects such as spiders, ants, earwigs, and more. To use it around your lawn, dilute as directed (typically 20 mL of product per L of water) and apply as a coarse spot spray on structures, tree trunks, garden borders, and foundations where pests are entering or congregating. It should not be sprayed on the lawn itself, turf, or soil, and you should avoid treating areas where children and pets play to minimize exposure. Reapply only if pest activity resumes, usually after 14 days.",
            "legality": "Superior Control Products' Spider and Insect Destroyer is legally registered for use in Canada under Health Canada's Pest Management Regulatory Agency (PMRA), bearing Registration No. 27511 for permethrin-based insecticide formulations and undergoing federal re-evaluation as part of standard regulatory procedures. The product's registration confirms it meets Canadian federal standards under the Pest Control Products Act, ensuring it has been assessed for safety and effectiveness. While federal approval allows it to be sold and used across Canada, users should remain aware that certain provinces or municipalities may impose local restrictions on outdoor permethrin-based applications, so checking regional guidelines before purchase and use is advisable.",
            "pros": "Superior Control Products Spider and Insect Destroyer offers effective control against a wide range of common crawling pests such as spiders, ants, fleas, and cockroaches. Its active ingredient, permethrin, provides rapid knockdown and long-lasting residual protection, helping to keep treated areas pest-free for up to 60 to 90 days. The product is versatile, suitable for use both indoors and outdoors on surfaces like building exteriors, patios, and garden structures. Its ready-to-use liquid form and convenient sprayer make application easy, while its water-based formula reduces strong odors compared to solvent-based insecticides. Overall, it's a reliable and user-friendly solution for managing household and garden pests.",
            "cons": "While Superior Control Products Spider and Insect Destroyer is effective, it has some drawbacks. Its active ingredient, permethrin, can be toxic to beneficial insects like bees and aquatic life, so careful application is necessary to avoid environmental harm. It should not be used directly on lawns or turf, limiting its use to structural and perimeter treatments. Some users may find that repeated applications are needed to manage heavy infestations, and improper use could lead to pesticide resistance. Additionally, as a chemical insecticide, it requires precautions such as keeping pets and children away from treated areas until dry.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "superior-control-products-spider-insect-destroyer"
        },
        {
            "name": "Wilson Ant Out",
            "chemical": "Permethrin",
            "image": "Insecticides/wilson-ant-out.png",
            "description": "Wilson Ant Out Ant Killer Spray is a ready-to-use insecticide formulated with 0.25% permethrin, a synthetic pyrethroid that effectively targets ants and other crawling insects. This product is designed for both indoor and outdoor applications, providing fast-acting results killing ants within 15 minutes to an hour upon contact. Its residual effects can last up to two weeks, making it suitable for treating areas like building foundations, patios, and entry points where ants are active. The spray is water-based and includes a rosemary essential oil, leaving behind a pleasant scent without leaving a white residue on surfaces. For optimal results, it is recommended to use Wilson Ant Out Ant Baits in conjunction with the spray to eliminate entire colonies.",
            "application": "To apply Wilson Ant Out Permethrin on your lawn, first shake the bottle well. Spray directly onto ant trails, mounds, and other areas where ants are active, holding the nozzle about 30 cm above the ground. Apply a light, even coating to targeted spots rather than broadcasting over the entire lawn. Allow the treated areas to dry completely before allowing pets or children back into the area. If ants persist, reapply after seven days. Always follow the label instructions and avoid spraying directly on edible plants or crops.",
            "legality": "Wilson Ant Out Permethrin is a pest control product registered in Canada under the Pest Control Products Act. Specifically, it is registered as \"Wilson Ant Out Ant & Roach Killer\" with Health Canada's Pest Management Regulatory Agency (PMRA), registration number 31898. This registration ensures that the product meets Canadian standards for human health and environmental safety when used according to the label directions. It's important to note that all pesticides used in Canada must be registered under the Pest Control Products Act, and using a pesticide contrary to the label directions is a violation of this Act. Therefore, consumers should always follow the instructions provided on the product label to ensure safe and effective use.",
            "pros": "Wilson Ant Out Permethrin offers several advantages for homeowners dealing with ant infestations. Its permethrin-based formula delivers rapid results, effectively eliminating ants within 15 minutes to an hour upon contact. The product is versatile, suitable for both indoor and outdoor applications, including lawns, patios, and building foundations. Additionally, it features a water-based composition that ensures no unsightly residue is left behind, maintaining the cleanliness of treated areas. For optimal results, it is recommended to use Wilson Ant Out Ant Baits in conjunction with the spray to eliminate entire colonies.",
            "cons": "Wilson Ant Out Permethrin, while effective, has some drawbacks. Its active ingredient, permethrin, can be harmful to beneficial insects like bees and aquatic life, requiring careful application to avoid environmental damage. The product may also pose risks to pets and children if they come into contact with treated areas before the spray dries. Additionally, permethrin-based sprays can lose effectiveness over time, sometimes necessitating multiple applications to fully control infestations. Users must follow label directions closely to ensure safety and optimal results.",
            "notes": "",
            "amazonLink": "https://amzn.to/4ffpVz0",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-ant-out"
        },
        {
            "name": "Wilson Ant Out (Nematodes)",
            "chemical": "Nematodes",
            "image": "Insecticides/wilson-nematodes-ant-out.png",
            "description": "Wilson Ant Out Nematodes provide an eco-friendly solution for controlling ant populations in lawns and gardens. These naturally occurring microscopic worms target and kill young ant larvae within nests, effectively disrupting the colony's development. By preventing adult ants from establishing new nests in treated areas, the nematodes offer long-lasting protection against future infestations. The application process is straightforward: simply mix the nematodes with water and apply the solution to affected areas using a sprayer or watering can. This method ensures that the nematodes reach the soil where ant larvae reside. One package of Wilson Ant Out Nematodes can treat approximately 1,000 square feet, making it suitable for both residential lawns and garden borders. Notably, this product is harmless to humans, pets, plants, and beneficial insects, aligning with sustainable gardening practices. It's available across most Canadian regions, excluding Newfoundland and Labrador.",
            "application": "To apply Wilson Ant Out Nematodes to your lawn, mix the nematodes with water according to the package instructions to create a solution. Use a sprayer, watering can, or garden hose attachment to evenly distribute the mixture over the infested areas, focusing on spots where ants are active or where nests are suspected. Apply the nematodes during cooler parts of the day, such as early morning or late afternoon, to prevent them from drying out in direct sunlight. Keep the soil moist for several days after application to help the nematodes establish and effectively target ant larvae. Avoid using chemical insecticides before or shortly after treatment, as these can harm the nematodes.",
            "legality": "Wilson Ant Out Nematodes are legally approved for sale and use across most Canadian provinces, excluding Newfoundland and Labrador. This product contains naturally occurring microscopic nematodes that target and kill ant larvae in soil, offering an eco-friendly alternative to chemical pesticides. It is registered and compliant with Canadian regulations, ensuring safety for humans, pets, plants, and the environment when used as directed. Available at various Canadian retailers, including Home Hardware and Walmart Canada, Wilson Ant Out Nematodes provide an effective solution for ant control in lawns and gardens.",
            "pros": "Wilson Ant Out Nematodes offer several advantages for homeowners seeking an eco-friendly solution to ant infestations. These naturally occurring microscopic worms target and eliminate young ant larvae within nests, effectively disrupting the colony's development. By preventing adult ants from establishing new nests in treated areas, the nematodes provide long-lasting protection against future infestations. The application process is straightforward: mix the nematodes with water and apply the solution to affected areas using a sprayer or watering can. This method ensures that the nematodes reach the soil where ant larvae reside. Notably, this product is harmless to humans, pets, plants, and beneficial insects, aligning with sustainable gardening practices. It's available across most Canadian regions, excluding Newfoundland and Labrador.",
            "cons": "Wilson Ant Out Nematodes, while environmentally friendly, have some limitations. They require moist soil conditions and cooler temperatures for optimal effectiveness, which can limit their use during hot, dry periods or extreme weather. Results may take longer to appear compared to chemical insecticides, as nematodes work by infecting and killing ant larvae over time rather than providing immediate knockdown. Additionally, they are species-specific and only target certain pests, so they may not be effective against all types of ants or other insects. Proper storage and handling are essential, as nematodes are living organisms that can lose viability if exposed to heat or sunlight.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-ant-out-nematodes"
        },
        {
            "name": "Wilson Bug-X Out Chinch Bugs",
            "chemical": "Nematodes",
            "image": "Insecticides/wilson-bug-x-out.png",
            "description": "Wilson BUG-X OUT Chinch Bug Nematodes offer a natural and effective solution for controlling chinch bug infestations in lawns and gardens. These microscopic worms, when activated with water, seek out and infect chinch bugs and their larvae with a pathogen, leading to their death within a day or two. The nematodes then reproduce on the deceased insects, continuing the cycle of pest control. This product is pesticide-free, making it safe for humans, pets, plants, and beneficial insects. A single application can cover up to 3,000 square feet, and the nematodes remain effective in the soil for up to 30 days. For optimal results, it's recommended to apply the nematodes when soil temperatures are between 10C and 32C (50F - 90F) and to keep the lawn moist for several days post-application. The product is available across most Canadian regions, excluding Newfoundland and Labrador.",
            "application": "To apply Wilson Bug-X Out Chinch Bug Nematodes to your lawn, first water the area thoroughly 24 to 48 hours before treatment to moisten the soil and encourage chinch bugs to come closer to the surface. Prepare the nematode solution by placing the sealed nematode bag into your sprayer, adding warm water and the included wetting agent, then shaking well to distribute the nematodes evenly. Spray the mixture evenly over the affected lawn areas, ensuring thorough coverage while periodically agitating the solution to keep the nematodes suspended. After application, keep the lawn moist for at least three days or longer if conditions are dry to help the nematodes penetrate the soil and effectively target chinch bugs. Following these steps maximizes the nematodes' ability to control chinch bug populations naturally and safely.",
            "legality": "Wilson BUG-X OUT Chinch Bug Nematodes are legally available for purchase and use in most regions of Canada, with the exception of Newfoundland and Labrador. This product is registered with Health Canada and is compliant with the Pest Control Products Act, making it a lawful and environmentally friendly option for controlling chinch bug infestations. Unlike traditional chemical pesticides, these nematodes are naturally occurring microscopic worms that target and eliminate chinch bug larvae without posing harm to humans, pets, plants, or beneficial insects. Its registration status is current, and there are no known restrictions on its sale or use across Canadian provinces.",
            "pros": "Wilson BUG-X OUT Chinch Bug Nematodes offer several advantages for homeowners seeking an eco-friendly solution to chinch bug infestations. These naturally occurring microscopic worms target and eliminate chinch bug larvae within nests, effectively disrupting the colony's development. By preventing adult chinch bugs from establishing new nests in treated areas, the nematodes provide long-lasting protection against future infestations. The application process is straightforward: mix the nematodes with water and apply the solution to affected areas using a sprayer or watering can. This method ensures that the nematodes reach the soil where chinch bug larvae reside. Notably, this product is harmless to humans, pets, plants, and beneficial insects, aligning with sustainable gardening practices. It's available across most Canadian regions, excluding Newfoundland and Labrador.",
            "cons": "Wilson Bug-X Out Chinch Bug Nematodes have some limitations despite their eco-friendly benefits. They require specific soil moisture and temperature conditions to be effective, meaning their success can be reduced during hot, dry weather or extreme temperatures. Results may take longer to appear compared to chemical treatments, as nematodes work by infecting and killing chinch bug larvae over time rather than providing immediate control. Additionally, proper storage and handling are crucial because these are living organisms that can lose viability if exposed to heat or sunlight. Lastly, the product may not completely eradicate severe infestations on its own and might need to be part of an integrated pest management approach.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-bug-x-out-chinch-bugs"
        },
        {
            "name": "Wilson Bug-X Out Leatherjackets",
            "chemical": "Nematodes",
            "image": "Insecticides/wilson-nematodes-leather-jacket.png",
            "description": "Wilson Bug-X Out Leatherjackets is a biological lawn treatment that uses beneficial microscopic worms, specifically Steinernema feltiae, to naturally target and eliminate leatherjackets (the larvae of crane flies). These nematodes seek out and infect the pests with a symbiotic bacterium, killing them within a few days without harming beneficial insects, pets, or humans. This environmentally friendly solution is ideal for homeowners looking to avoid chemical insecticides while still protecting their lawns from root damage, yellowing grass, and turf disruption caused by birds and animals digging for larvae. The nematodes are applied by watering them into the soil, typically in early spring or fall when leatherjackets are most active. Wilson Bug-X Out Nematodes provides a sustainable and effective way to restore lawn health and maintain a vibrant, resilient turf.",
            "application": "To apply Wilson Bug-X Out Leatherjackets neamtodes to your lawn, first mix the nematodes with water according to the package instructions. Use a watering can, hose-end sprayer, or nematode applicator to evenly distribute the solution over the affected area. Apply in the early morning or late afternoon on a cloudy day to avoid direct sunlight, which can harm the nematodes. After application, thoroughly water the lawn to help the nematodes move into the soil where the leatherjackets reside. Keep the soil moist for at least a week to support nematode activity and ensure effective control.",
            "legality": "Wilson BUG-X OUT Leatherjacket Nematodes, containing Steinernema feltiae, is legally available across Canada, with distribution in all provinces and territories except Newfoundland and Labrador. In Canada, nematodes like S. feltiae are treated as naturally occurring beneficial organisms and are not regulated as pesticides, meaning no special license or permit is required for home use",
            "pros": "Wilson Bug-X Out Leatherjackets Nematodes offers several advantages for homeowners looking for a natural solution to lawn pests. It uses beneficial nematodes to target leatherjackets without harming people, pets, or beneficial insects. Because it's a biological treatment, it's safe for the environment and leaves no chemical residue. It's also easy to apply and can be used as part of an organic lawn care routine. When used correctly, it provides effective control by breaking the life cycle of leatherjackets and helping to restore healthy turf.",
            "cons": "One drawback of Wilson Bug-X Out Leatherjackets Nematodes is that it requires specific conditions to work effectively. The nematodes need moist soil and mild temperatures, so timing and weather are important. They are also sensitive to sunlight and may die if applied during hot, dry conditions. Unlike chemical treatments, results can take several days to become noticeable. Additionally, proper storage and quick application after purchase are necessary, as the nematodes are living organisms with a limited shelf life.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-bug-x-out-leatherjackets"
        },
        {
            "name": "Wilson Bug-X Out Insecticidal Soap",
            "chemical": "Triethanolamine Salts of Fatty Acids",
            "image": "Insecticides/wilson-bug-x-out-soap.png",
            "description": "Wilson Bug-X Out Insecticidal Soap is a contact insecticide designed to control soft-bodied insects such as aphids, whiteflies, mealybugs, and spider mites on outdoor plants. It works by using potassium salts of fatty acids to weaken the insects' outer protective layers, causing them to dehydrate and die shortly after contact. This product is ideal for gardeners looking for a low-toxicity option that breaks down quickly in the environment and leaves no harmful residue. Safe for use on flowers, vegetables, shrubs, and ornamentals, it offers an effective solution for controlling pests without harming beneficial insects when used as directed. Regular application may be needed for ongoing infestations.",
            "application": "To apply Wilson Bug-X Out Insecticidal Soap to your lawn, start by thoroughly shaking the bottle to mix the solution. Spray it directly onto affected areas, making sure to coat the insects and the underside of leaves where pests often hide. Apply in the early morning or late evening to avoid direct sunlight, which can reduce effectiveness and increase the risk of plant damage. Avoid spraying during windy conditions or when rain is expected within a few hours. Repeat applications may be needed every few days until the infestation is under control.",
            "legality": "Wilson Bug-X Out Insecticidal Soap is legally registered for use in Canada. According to Health Canada's Pest Management Regulatory Agency (PMRA), the product is registered under Registration Number 30991 and is approved for use as an acaricide and insecticide. The registration is valid until December 31, 2025, with re-evaluation scheduled.",
            "pros": "Wilson Bug-X Out Insecticidal Soap offers several notable advantages for gardeners seeking an effective and environmentally friendly pest control solution. Formulated with triethanolamine salts of fatty acids, this product targets soft-bodied insects like aphids, mealybugs, spider mites, and whiteflies through desiccation and suffocation mechanisms. Its ready-to-use spray bottle ensures ease of application without the need for mixing, making it convenient for both indoor and outdoor use on various plants, including fruits, vegetables, flowers, and ornamentals. Additionally, the soap is biodegradable and breaks down quickly in the environment, leaving no harmful residues, which is particularly beneficial for edible crops. This combination of effectiveness, safety, and convenience makes Wilson Bug-X Out Insecticidal Soap a valuable tool for sustainable gardening practices.",
            "cons": "Wilson Bug-X Out Insecticidal Soap has some limitations to consider. It works only on soft-bodied insects and must come into direct contact with pests to be effective, so it may not control eggs or hard-shelled insects. Frequent applications might be necessary for severe infestations, which can be time-consuming. Additionally, it can sometimes cause mild damage or leaf burn to sensitive plants if applied in hot or sunny conditions. Careful application and following label instructions are important to avoid these issues.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-bug-x-out-soap"
        },
        {
            "name": "Wilson Crawl Out",
            "chemical": "Permethrin",
            "image": "Insecticides/wilson-crawl-out.jpg",
            "description": "Wilson Crawl Out is a versatile pest control solution designed to eliminate a wide range of crawling insects both indoors and outdoors. This product is available in several formulations, including a ready-to-use spray and a battery-powered sprayer, making it suitable for various application needs. It effectively targets pests such as ants, cockroaches, spiders, silverfish, fleas, and carpet beetles. The insecticide works by acting on the nervous system of insects, causing paralysis and death. It provides a fast knockdown effect, with results typically visible within 15 minutes to an hour, and offers residual action that lasts for several days. Additionally, Wilson Crawl Out Insecticide contains essential oils, like rosemary, which leave behind a pleasant scent. When used as directed, it is safe for people and pets. This product is ideal for use in various areas, including homes, gardens, patios, and other outdoor spaces. Always follow the label instructions for safe and effective use.",
            "application": "To apply Wilson Crawl Out Insecticide to your lawn, shake the bottle well before use. Spray evenly over the affected areas, focusing on spots where crawling insects are commonly seen, such as near shrubs, flower beds, and along walkways. For best results, apply when the lawn is dry and avoid watering for at least 24 hours after treatment to allow the insecticide to work effectively. Use caution to keep pets and children off the treated area until it has fully dried. Repeat applications as needed, following the label instructions.",
            "legality": "Wilson Crawl Out Insecticide is legally registered for sale and use in Canada. The product has been approved by Health Canada's Pest Management Regulatory Agency (PMRA) and is registered under the following numbers: Registration Number 26901: Wilson Crawl Out Home Pest Control, Registration Number 26904: Wilson Crawl Out Home Pest Control with Battery Sprayer, and Registration Number 32035: Wilson Crawl Out Crawling Insect Killer. These registrations confirm that the products have been evaluated for safety and efficacy when used according to label directions. The active ingredient in these formulations is permethrin, a synthetic pyrethroid insecticide effective against a variety of crawling insects.",
            "pros": "Wilson Crawl Out Insecticide offers several advantages for homeowners seeking effective pest control. Its ready-to-use formulations, including sprays and battery-powered sprayers, provide convenience and ease of application. The product is effective against a wide range of crawling insects, such as ants, spiders, cockroaches, and silverfish, making it versatile for various pest problems. Additionally, Wilson Crawl Out contains essential oils like rosemary, leaving behind a pleasant scent and reducing reliance on harsh chemicals. When used as directed, it is safe for both people and pets, offering peace of mind to users. These features make Wilson Crawl Out a practical and user-friendly choice for maintaining a pest-free environment.",
            "cons": "Wilson Crawl Out has some drawbacks to consider. Because it contains permethrin, a synthetic chemical, it may pose risks to beneficial insects like bees and aquatic life if not used carefully. It requires cautious application to avoid contact with skin and eyes, and users should keep pets and children away from treated areas until fully dry. Additionally, repeated use may lead to insect resistance over time. It is important to follow label instructions closely to minimize any negative impacts and ensure safe, effective use.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-crawl-out"
        },
        {
            "name": "Wilson Grub Out",
            "chemical": "Nematodes",
            "image": "Insecticides/wilson-grub-out.png",
            "description": "Wilson Grub Out is a natural, pesticide-free solution designed to control white grubs and other soil-dwelling pests in lawns and gardens. Utilizing beneficial nematodes (microscopic, non-pathogenic worms) this product targets various pests, including European chafer larvae, Japanese beetle larvae, June beetle larvae, leatherjackets, cutworms, and sod webworms. These nematodes actively seek out and infect pests, delivering a pathogen that kills the host within 1 to 2 days. As the nematodes reproduce, they continue to control pest populations over time. Wilson Grub Out is safe for humans, pets, plants, and the environment, making it an eco-friendly alternative to chemical pesticides. The product is easy to apply using a hose-end sprayer, covering up to 275 m (3,000 sq ft), and is most effective when applied during the pests' active feeding periods, typically late April to mid-June and early August through October.",
            "application": "To apply Wilson Grub Out to your lawn, first mix the nematodes with water according to the package instructions. Use a hose-end sprayer or watering can to evenly distribute the solution over the affected areas. Apply in the early morning or late afternoon when temperatures are cooler and avoid direct sunlight to protect the nematodes. After application, water the lawn lightly to help the nematodes penetrate the soil where grubs live. Keep the soil moist for at least a week to ensure the nematodes remain active and effective in controlling grub populations.",
            "legality": "Wilson Grub Out, featuring beneficial nematodes, is legally registered for use in Canada. The product has been approved by Health Canada's Pest Management Regulatory Agency (PMRA) and is registered under Registration Number 34227: Wilson Grub Out Chinch Bug and Grub Killer.",
            "pros": "Wilson Grub Out offers several advantages for homeowners seeking effective and environmentally friendly pest control. Utilizing beneficial nematodes, this product targets over 10 species of white grubs, including European chafer and Japanese beetle larvae, as well as other pests like cutworms and sod webworms. The nematodes actively seek out and infect grubs, delivering a pathogen that kills the host within 1 to 2 days. Once in the soil, they continue to reproduce, providing ongoing control. Wilson Grub Out is safe for humans, pets, plants, and the environment, making it a non-toxic alternative to chemical pesticides. It is easy to apply using a hose-end sprayer and covers up to 275 m (3,000 sq ft), offering a convenient solution for lawn care.",
            "cons": "Wilson Grub Out has a few limitations to consider. Because it relies on living nematodes, its effectiveness depends heavily on proper application conditions such as soil moisture and temperature. The nematodes can be sensitive to direct sunlight and drying out, which can reduce their survival and impact. Results may take several days to appear, and multiple applications might be necessary for severe infestations. Additionally, it may not provide immediate relief compared to chemical treatments, so patience and careful timing are important for best results.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-grub-out"
        },
        {
            "name": "Wilson Spider Out",
            "chemical": "Permethrin",
            "image": "Insecticides/wilson-spider-out.png",
            "description": "Wilson Spider Out is a ready-to-use insecticide designed to eliminate spiders both indoors and outdoors. It contains permethrin (0.25%), a synthetic pyrethroid that targets the nervous system of spiders, causing paralysis and death. The product also includes rosemary essential oil, leaving behind a pleasant residual aroma. Wilson Spider Out is available in two formulations: a pump spray for targeted application in cracks and crevices, and an aerosol spray that can be used from any angle to reach hard-to-access areas. Both versions are effective on contact and provide residual protection for up to a week when applied in shaded areas. They are safe for humans and pets when used as directed and are suitable for use around doorways, windows, patios, and other common entry points.",
            "application": "To apply Wilson Spider Out to your lawn, shake the bottle well before use and spray directly onto areas where spiders and webs are visible, such as around shrubs, garden beds, and outdoor structures. For best results, apply during calm weather to prevent the spray from drifting and avoid watering or rain for at least 24 hours after application to allow the insecticide to work effectively. Keep pets and children away from treated areas until the spray has fully dried. Repeat applications as needed to maintain control.",
            "legality": "Wilson Spider Out is a legally registered pesticide in Canada. It has been approved by Health Canada's Pest Management Regulatory Agency (PMRA) under the Pest Control Products Act, with the registration number 31900. This registration ensures that the product has been evaluated for safety and efficacy when used according to the label directions. Therefore, it is legal to purchase and use Wilson Spider Out across Canada, including in Ontario.",
            "pros": "Wilson Spider Out offers several advantages for homeowners seeking effective spider control. Its active ingredient, permethrin, acts swiftly to eliminate spiders upon contact, making it ideal for immediate intervention. The product is versatile, suitable for both indoor and outdoor applications, including areas like patios, doorways, and window frames. Its formulation includes rosemary essential oil, leaving behind a pleasant aroma and enhancing user experience. Additionally, Wilson Spider Out is available in both aerosol and ready-to-use spray formats, providing flexibility to address various needs and preferences.",
            "cons": "Wilson Spider Out has some drawbacks to consider. It contains permethrin, a synthetic chemical that can be toxic to beneficial insects like bees and aquatic life if not used carefully. The spray may also irritate skin, eyes, or respiratory systems, so protective measures should be taken during application. It provides only temporary control, requiring repeated applications to keep spiders away. Additionally, care must be taken to avoid overuse to prevent environmental impact and potential development of insect resistance.",
            "notes": "",
            "amazonLink": "",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "wilson-spider-out"
        }
    ]
}