{
    "tools": [
        {
            "name": "Battery Powered Backpack Sprayer (2 gallon)",
            "brand": "PetraTools",
            "image": "Tools/battery-sprayer.jpg",
            "description": "The PetraTools 2-Gallon Battery Powered Sprayer is a convenient and efficient solution for applying fertilizers, herbicides, insecticides, and other lawn and garden treatments. Powered by a rechargeable battery, this sprayer eliminates the need for manual pumping, allowing for continuous, consistent spray pressure with minimal effort. Its 2-gallon tank strikes a balance between capacity and portability, making it suitable for medium-sized lawns and garden areas. The unit typically includes a variety of nozzles for different spray patterns and a comfortable shoulder strap for easier handling. Designed for both homeowners and light professional use, it offers a time-saving and user-friendly alternative to traditional pump sprayers.<ul><li>NEVER PUMP AGAIN: The HD2000 Battery Backpack Sprayer sprays for 2-3 hours on a single battery charge or over 50 gallons of solution - the perfect electric backpack sprayer. Spray continuously with its 70 PSI pump. The powerful lead-acid battery provides 3X the battery life of most other lithium battery sprayers. Battery and AC charger included.</li><li>AMERICAN FAMILY-OWNED COMPANY AND USA SUPPORT: PetraTools is a USA-based company located in Carlisle, Pennsylvania. All PetraTools products have a 100% satisfaction guarantee and excellent USA customer service members waiting by the phone to answer any questions you may have. PetraTools continues to work hard to deliver top-quality sprayers and solutions to keep your home, lawn, and places of business clean, green, and safe.</li><li>BRAND NEW COMPACT 2-GALLON DESIGN: Can't deal with those heavy and bulky sprayers? This is the compact backpack sprayer design for you! The HD2000 electric backpack sprayer has comfortable double-thick straps and a wide-mouth opening for easy filling of solution into the tank. No more spills and time-wasting cleanups! The translucent tank also shows at a glance how much solution is left.</li><li>5 NOZZLES & MULTIPURPOSE WAND: PetraTools wants you to have a battery-powered backpack sprayer for every situation! There is a reason hundreds of thousands of customers love their Petra sprayer. Specially designed to meet your everyday needs, the multipurpose wand and five included nozzles make it ideal for indoor and outdoor spraying of all types of solutions.</li><li>ULTRACOMFORT BACKPACK STRAPS: The backpack weed sprayer HD2000 comes with double-padded backpack sprayer straps that make this an ideal compact garden sprayer battery-powered. It also includes a variable PSI adjuster and translucent tank with gallon markers.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/3TYtekr",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "pump-pressured-backpack-sprayer"
        },
        {
            "name": "Battery Powered Dethatcher & Scarifier (15 inch)",
            "brand": "Sun Joe",
            "image": "Tools/dethatcher.jpg",
            "description": "The Sun Joe 24V-X2-DTS15 Scarifier and Dethatcher Kit delivers professional-grade lawn care without the hassle of cords or gas. Its 15-inch wide path and five adjustable depth positions let you easily penetrate and lift thatch or moss to promote healthier turf. Powered by a brushless motor for longer runtime and reduced maintenance, it comes complete with two 24-V 4.0-Ah lithium-ion batteries and a dual-port charger so you can keep one battery in use while the other recharges. Lightweight and maneuverable, this kit makes yard cleanup faster, quieter, and more eco-friendly compared to traditional dethatching tools.<ul><li>24-VOLT SYSTEM: iON+ 48-Volt Battery System compatible — Includes two 24-Volt 4.0 Ah battery that provides up to 20 minutes of rechargeable runtime</li><li>IDEAL: For revitalizing your lawn and prepping for new seed planting</li><li>POWERFUL: 600 W brushless motor rakes a 14.2\" wide path to get your job done faster</li><li>HEALTHIER LAWNS: Scarifier function to cut grass roots for thicker growth</li><li>AIRBOOST TECHNOLOGY: spring steel tines for maximum thatch pickup</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/3TXb1nj",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "sun-joe-dethatcher"
        },
        {
            "name": "Battery Powered Edger (80V, 8 inch)",
            "brand": "Greenworks",
            "image": "Tools/battery-edger.jpg",
            "description": "The Greenworks 80V 8\" Brushless Cordless Edger combines cordless convenience with professional performance for clean, precise lawn edges. Its brushless motor delivers longer run time and reduced maintenance compared to brushed models, while the 8-inch steel blade cuts through soil and grass with ease. You can customize your edging depth with the adjustable height setting, and the onboard wheel guide helps keep straight, uniform lines along sidewalks and flower beds. Powered by any Greenworks 80V battery (sold separately), this lightweight, vibration-reduced tool is easy to maneuver and store, making quick work of lawn detailing without the hassle of cords or gas.<ul><li>8\" EDGER BLADE - with curb wheel guarantees the perfect edging every time</li><li>BRUSHLESS MOTOR - Provides more torque, quiet operation, and longer life</li><li>TOOL-LESS DEPTH ADJUSTMENT - allows added control over cutting depth</li><li>LIGHTWEIGHT / EASY TO USE - ultra lightweight design, along with superior ergonomics allow for reduced user fatigue</li><li>MAINTENANCE FREE - This edger is virtually maintenance free, with no gas, no oil, and no emissions. It starts instantly, is quiet, and delivers to the power you need​",
            "notes": "",
            "amazonLink": "https://amzn.to/40H9wNH",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "battery-edger"
        },
        {
            "name": "Battery Powered Lawn Mower (48V, 17 inch)",
            "brand": "Greenworks",
            "image": "Tools/battery-mower.jpg",
            "description": "The Greenworks 48V 17\" Lawn Mower delivers reliable, cordless performance by running two 24-volt 4 Ah batteries in series to create a full 48 V power system. Its brushless motor provides consistent cutting torque and quieter operation, while the 17-inch steel deck offers a balance between maneuverability and coverage for small to medium-sized lawns. A single-lever, 7-position height adjustment lets you fine-tune your cut from 1 1/4 inches to 3 3/8 inches, and the 2-in-1 design enables side discharge or rear bagging to suit your clean-up preference. Lightweight and easy to push, this mower starts instantly with the push of a button and requires minimal maintenance (no oil changes, spark plugs, or tune-ups) so you can spend less time on upkeep and more time enjoying a well-groomed lawn.<ul><li>[LONG LASTING] The lightweight, rust-proof 17-inch poly deck ensure easy maneuverability. With 6 different cutting height options, you can ensure the best cut in all environments.</li><li>[PUSH] Work at your own pace and embrace simplicity with our lightweight, easy to use push mower.</li><li>[PERFORMANCE] Highly efficient brushless motor provides increased torque, longer run times, quiet operation, and extended motor life. Equipped with innovative Smart Cut Technology to automatically adjust the speed of the blade when more power is needed for the best cut possible.</li><li>[CHOOSE YOUR WAY] Convenient 2-in-1 cutting deck lets you choose your cut finish from mulching or bagging.</li><li>[NEVER STOP CUTTING] Individual battery port to accept all your Greenworks 24V batteries. Up to 40 minutes of runtime and a charge time of 120 minutes.</li><li>[CONVENIENT STORAGE] Adjustable handle positions to suit your height and ergonomic easy-to-use user controls guarantee ultimate comfort. Plus, use up to 70% less space in your garage with folding handles for compact vertical storage.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/41eJwcL",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "battery-mower"
        },
        {
            "name": "Battery Powered Leaf Blower",
            "brand": "Greenworks",
            "image": "Tools/battery-blower.jpg",
            "description": "The Greenworks Pro 80V Brushless Cordless Axial Blower delivers high-velocity performance without the fuss of gas or cords. Its brushless motor generates up to 145 MPH airspeed and 580 CFM airflow, making quick work of drying driveways, clearing debris from patios, and tidying garden beds. The axial fan design maximizes power and efficiency, while variable-speed and cruise-control settings let you dial in the perfect airflow for light cleanup or heavy-duty leaf blowing. Lightweight and balanced, it features an ergonomic soft-grip handle for comfortable all-day use. Compatible with any Greenworks Pro 80V battery (sold separately), this blower offers instant starts, tool-free maintenance, and whisper-quiet operation compared to gas models.<br><br>Green Works is starting a revolution in outdoor power equipment starting with its Green Works Pro 80V Li-Ion MAX system. Combined with our Digital Pro Brushless motor, this is the highest voltage, gas equivalent, commercial grade cordless outdoor power tool system in the industry.  Featuring the simple electric start, light weight designs and quieter motor, professionals and heavy Dyers can now tackle tough jobs through variable terrain without the hassle of gas, fumes, heavy gear or delicate maintenance needs of gas powered engines.  The evolution of Green Works lithium-ion technology and designs have made it possible for professionals to get their jobs done by simply snapping in a battery and pressing a button while delivering high performance power and longer run time to get the job done.  Green Works Pro 80V Li-Ion MAX System features a Jet Blower, 18-inch Chainsaw, Hedge Trimmer, String Trimmer, Lawn Mower. With Green Works, we understand that it's not just a toolkit's your life.<ul><li>Powerful brushless motor and turbo button provides 580 CFM at 145 MPH, quiet operation and longer life</li><li>Reduced fatigue with comfort over mold grip, variable speed trigger and cruise control, Variable Speed Trigger - Provides on-demand power.</li><li>Quick charger provides full recharge in 40 minutes putting you back to work.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/4fjCs4A",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "battery-blower"
        },
        {
            "name": "Corded Dethatcher & Scarifier (14 inch)",
            "brand": "Greenworks",
            "image": "Tools/corded-dethatcher.jpg",
            "description": "The Greenworks 13 Amp 14-Inch Corded Dethatcher delivers reliable, corded power for removing thatch and moss build-up on small to medium lawns. Its 13 Amp motor spins 24 spring-steel tines at 1,650 RPM, while the 14-inch dethatching path balances coverage and maneuverability. You can choose from three depth settings to tailor the tine penetration to your turf conditions, and the ergonomic handle with cushioned grip keeps fatigue at bay during extended use. A built-in cord lock prevents accidental disconnection, and the lightweight design makes storage and transport hassle-free. By loosening compacted thatch, this dethatcher helps improve air, water, and nutrient flow to grass roots, promoting a healthier, more vigorous lawn.<ul><li>2-IN-1 DESIGN - 13A 15-Inch Dethatcher / Scarifer provides the power and versatility to keep your lawn healthy.No load speed : 3200 RPM</li><li>LIGHTWEIGHT, EASY TO USE - Lightweight design allows for easy manuevering. Easy push button start</li><li>QUICK RELEASE - Quickly and easily switch between the included dethacther and scarifier attachments</li><li>3-POSITION - tine depth adjustment for removing matted layers for healthy lawn growth</li><li>HEALTHY LAWN - Keep your yard healthy by dethathcing in early spring or early fall for cool-season grasses, and in late spring through early summer (after 2nd mowing) for warm-season grasses</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/44QkDq9",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "greenworks-dethatcher"
        },
        {
            "name": "Corded Edge Hog (2.25 HP)",
            "brand": "BLACK+DECKER",
            "image": "Tools/corded-edger.jpg",
            "description": "The BLACK+DECKER Edge Hog 2-1/4 HP Electric Landscape Edger makes quick work of defining clean, professional borders around driveways, sidewalks, and flower beds. Its 2 1/4 horsepower motor provides ample power to slice through turf and soil, while the 6-inch steel blade ensures a precise cut with each pass. With a simple depth adjustment lever, you can tailor your edge to shallow or deep grooves up to 2 inches, and the dual-wheel design keeps the tool steady and easy to guide. The ergonomic loop handle and balanced weight minimize fatigue during longer edging sessions, and the built-in cord restraint helps prevent accidental unplugging. Ready to start at the push of a button, this electric edger delivers consistent performance without the hassle of gas or maintenance.<ul><li>12 amp high-torque motor tackles tough overgrowth and creates clean-looking trench</li><li>Exclusive pull-up edge guide converts from edger to landscape trencher</li><li>Tool-free assembly is quick and hassle-free</li><li>Built-in cord retention keeps extension cord secure</li><li>Three-position blade depth adjustment lets you control the cut rpm - 4700 rpm</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/4o9QlpL",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "corded-edger"
        },
        {
            "name": "Corded Lawn Mower (13A, 21 inch)",
            "brand": "Greenworks",
            "image": "Tools/corded-mower.jpg",
            "description": "The Greenworks 13 Amp 21-Inch Corded Lawn Mower (model 25112) delivers reliable, maintenance-free mowing power for medium to large yards. Its 13 Amp motor drives a 21-inch steel deck that balances wide coverage with nimble handling, so you spend less time cutting and more time enjoying your lawn. A single-lever, seven-position height adjustment lets you fine-tune your cut from 1 to 3 1/2 inches, while the 2-in-1 design offers both side discharge and rear bagging to suit your clean-up preference. The lightweight, ergonomic design features a foldable handle for compact storage and an integrated cord retention system to prevent accidental unplugging. With instant push-button start and no need for oil, spark plugs, or tune-ups, this mower makes lawn care fast, easy, and affordable.<ul><li>[POWER] Powered by a 13 Amp high-efficiency electric motor for a high-quality cut every time.</li><li>[DURABLE] The durable 21-inch steel deck allows you to handle large areas of grass quickly and easily. With 7 different cutting height options, you can ensure the best cut in all environments.</li><li>[PUSH] Work at your own pace and embrace simplicity with our lightweight, easy to use electric push mower. The cord retainer helps keep your extension cord secure while you take care of business. Recommended to use with following extension cords: 25' 14 AWG or 50' 12 AWG. For more details on appropriate extension cord use, please refer to the owners manual.</li><li>[CHOOSE YOUR WAY] Convenient (3-in-1) cutting deck lets you choose your cut finish from mulching, bagging or side discharge.</li><li>[EFFORTLESS MANEUVERABILITY] Equipped with 10-inch rear wheels and 7-inch front wheels for easy handling and transportation in even the toughest of terrains.</li><li>[CONVENIENT STORAGE] Ergonomic easy-to-use user controls guarantee ultimate comfort. Plus, use up to 70% less space in your garage with folding handles for compact storage.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/3UA2VB6",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "corded-mower"
        },
        {
            "name": "Corded Leaf Blower & Vacuum",
            "brand": "Greenworks",
            "image": "Tools/corded-blower.jpg",
            "description": "The Greenworks 24022 2-Speed 230 MPH Corded Blower/Vacuum combines powerful debris clearing with convenient mulching in one tool. Its brushless motor delivers up to 230 MPH airspeed on the high setting for fast removal of leaves, grass clippings, and light debris, while the low setting provides more control for delicate tasks. A quick-change lever lets you switch between blower and vacuum modes in seconds, and the included metal impeller reduces collected yard waste to 10:1 volume for easier disposal. The ergonomic wrap-around handle and adjustable auxiliary handle help reduce user fatigue, and the integrated cord lock prevents accidental power loss. Lightweight and ready to plug in, this blower/vacuum makes yard cleanup quick, quiet, and hassle-free.<ul><li>Designed to provide superior mulching and high powered performance</li><li>Powerful 12 amp motor generates 230 mph 375 cfm to clear debris, sticks, and leaves; Fan Design: Axial</li><li>2-speed control for better control in both blower and vacuum mode</li><li>Converts from blower to vacuum function with no tools required. Important: Use 14 gauge 50' or 12 gauge 100' extension cord. Air Speed : 150/230 MPH (241/370 Km/h)</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/4fujKr7",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "corded-blower"
        },
        {
            "name": "Gas Powered Backpack Leaf Blower (3.7 HP)",
            "brand": "Schröder",
            "image": "Tools/backpack-blower.jpg",
            "description": "The Schröder Industrial Backpack Leaf Blower Model SR-6400L pairs a powerful 3.7 HP two-stroke engine with a comfortable, ergonomically designed harness to tackle heavy-duty clearing tasks. Its backpack configuration evenly distributes weight across the shoulders and hips, reducing operator fatigue during extended use. The variable-speed throttle and ergonomic handle allow precise control of airflow, while the long, straight blower tube delivers concentrated air velocity for clearing leaves, grass clippings, and debris from lawns, driveways, and parking lots. Built-in anti-vibration mounts and padded straps further enhance comfort, and the durable construction ensures reliable performance in commercial and residential applications alike.<ul><li>Leaf blower: Schroder has the leading backpack leaf blower for both individuals and businesses. This commercial leaf blower will be the last leaf blower you will ever need.</li><li>German Design: This backpack leaf blower was designed in Germany, and it stands out for being one of the most powerful backpack blowers among comparable units in the market today.</li><li>Powerful engine: This gas blower equipped with a 2-stroke gasoline engine with 63.3 cc, 3.7 HP. You can effortlessly clear all wet and dry debris.</li><li>Comfortable fit: The powerful leaf blower weighs in at an ultra-light 19.5 pounds, comes with ergonomic padded shoulder straps and padded back support to help you feel comfortable.</li><li>Updated design with adjustable throttle.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/3IQcdq2",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "backpack-blower"
        },
        {
            "name": "Lawn Coring Aerator",
            "brand": "Dolibest",
            "image": "Tools/aerator.jpg",
            "description": "The Dolibest Lawn Coring Aerator is a manual, plug-style aerating tool designed to improve lawn health by alleviating soil compaction. Featuring a 4-plug design, it efficiently removes soil cores to enhance air, water, and nutrient penetration to grassroots. Constructed with rust-resistant stainless steel and a black powder-coated steel shaft, this aerator ensures durability and longevity. Its ergonomic soft rubber grip and foot bar facilitate comfortable use, while the integrated soil core storage tray simplifies cleanup by collecting the removed plugs. This tool is ideal for homeowners seeking an effective and eco-friendly solution for lawn aeration.<ul><li>Stainless Steel Corer Plug: Enjoy the durability and strength of this lawn coring aerator, which is made of all steel with a black powder coated finish, It with stainless steel bottom and corer plug that will not rust or bend.</li><li>Comfortable and Convenient: Experience the comfort and convenience of this lawn coring aerator, which has a soft rubber grip that prevents your hands from getting tired or blistered, The addition of a foot bar prevents shoes from interfering with the ejection of the core.</li><li>Soil and Lawn Improving: Improve your soil health and lawn appearance with this lawn corer tool that loosens the soil and allows air, water and fertilizer to reach the roots of your grass. This helps your plants grow stronger and healthier, and prevents lawn run-off and soil compaction.</li><li>Come with 12\" Weeder Handle Tool: Use this lawn coring aerator for other gardening tasks, Lawn aerators come with a 12\" hand tool that you could use to clean the aerator. It can also be used for transplanting seedlings and weeding, which is very convenient.</li><li>Easy to Ues: Choose the optimal size and shape of the cores for your lawn, with this lawn coring aerator that has 4 Corer Plug Aerator, each 3.5 inches long and 0.5 inches in diameter, Save time and effort with the easy-to-use and effective lawn corer tool. creating soil plugs that are deep and narrow.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/4mdrFuG",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "aerator"
        },
        {
            "name": "Long Handle Weed Remover (43.7 inch)",
            "brand": "ORMALLA",
            "image": "Tools/weed-puller.jpg",
            "description": "The ORMALLA Weed Puller is a manual, stand-up gardening tool designed to efficiently remove weeds like dandelions and crabgrass without the need for bending or kneeling. Equipped with a 43.7-inch natural bamboo handle, this tool allows users to maintain an upright posture while working. Its four steel claws, coated with an anti-rust powder finish, securely grip weeds by the roots, ensuring complete removal. The integrated foot pedal aids in driving the claws into the soil, enhancing leverage and minimizing strain. This eco-friendly, pet-safe tool is ideal for gardeners seeking a comfortable and effective solution for weed control.<ul><li>STAND-UP WEED PULLER: The 43.7in natural bamboo long handle lets you remove weeds without bending, kneeling or pulling. The all-metal claw and pedal with anti-rust powder coating ensures strength and long-lasting performance.</li><li>HEAVY DUTY 4 CLAWS: The 4 pointed metal claws can easily penetrate the ground and grasp the roots to pull them out. Works on all soil types and we recommend using the weed puller on wet and softer ground like after rain or watering.</li><li>NON-SLIP FOOT PEDAL: The foot pedal surface features a non-slip texture that allows you to safely step on it and put enough force on the weed remover tool to penetrate the ground and grab the weed, labor saving and efficient.</li><li>EASY TO INSTALL AND STORE: Simply twist the 3 poles together and good to use! Easily hang the garden tools on the wall using the hole in the handle.</li><li>GREEN WEED-CONTROL: Remove dandelions, crabgrass and other invasive weeds safely, making it safer for children, pets, and the environment. A great gift for grandfather, grandmother, grandpa, grandma, father, mother and friends.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/3IMGKFo",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "long-handle-weed-remover"
        },
        {
            "name": "Pump Pressured Backpack Sprayer (4 gallon)",
            "brand": "Chapin",
            "image": "Tools/backpack-sprayer.jpg",
            "description": "The Chapin 60114 4-Gallon Backpack Sprayer is a versatile, pump-pressured sprayer designed for homeowners and professionals seeking efficient application of fertilizers, herbicides, and pesticides. Its 4-gallon translucent poly tank allows users to monitor fluid levels easily, while the 4-inch wide mouth opening facilitates straightforward filling and cleaning. Equipped with a 3-stage filtration system (featuring filters in the shut-off, inside the tank, and with the cap) the sprayer minimizes clogging, ensuring consistent performance during extended use. The 20-inch poly extension wand and adjustable poly-cone nozzle offer flexibility in spray patterns, from a coarse stream to a fine mist, accommodating various application needs. For user comfort, the sprayer includes padded, adjustable shoulder straps with a waist strap, distributing weight evenly and reducing fatigue. Nitrile seals enhance chemical compatibility, making the sprayer suitable for a wide range of lawn and garden treatments. Proudly made in the USA with global materials, the Chapin 60114 combines durability with thoughtful design to meet diverse spraying requirements.<ul><li>4-GALLON DURABLE POLY TANK: durable 4-gallon translucent poly tank lets you see the tank capacity while filling and working, tank is durable and compatible with standard lawn and garden chemicals; 4-inch opening with filter cap to help catch debris when filling tank</li><li>MADE IN THE USA WITH GLOBAL MATERIALS: designed and produced in the USA with US-based customer service and technical support, located at Chapin's home base in Batavia, NY; backed by Chapin's 1-year limited warranty</li><li>3-STAGE FILTRATION SYSTEM: a standard for Chapin backpack sprayers, a filter is located in the shut-off, inside the tank and with the cap; 3 different locations to catch debris before it clogs up your sprayer while working; more spraying and less downtime</li><li>COMPONENTS: 20-inch poly extension wand to reach difficult areas, padded adjustable shoulder straps with waist strap and poly shut-off with lock-on feature so you don't need to constantly grip the shut-off to spray</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/40GKfTX",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "pump-pressured-backpack-sprayer"
        },
        {
            "name": "Turf Builder Edgeguard Mini Broadcast Spreader (5,000 sq.ft)",
            "brand": "Scotts",
            "image": "Tools/turf-builder.jpg",
            "description": "The Scotts 75121 Turf Builder EdgeGuard Mini Broadcast Spreader is a compact yet efficient tool designed for homeowners with small to medium-sized lawns. With a coverage capacity of up to 5,000 square feet, it ensures even distribution of fertilizers, grass seed, and ice melt. The EdgeGuard technology is a standout feature, allowing users to block the right side of the spreader pattern, preventing product from spilling onto driveways, sidewalks, or flower beds, thereby reducing waste and cleanup time. This spreader comes pre-calibrated and fully assembled, making it ready to use right out of the box. Its lightweight design and fold-down handle enhance portability and storage convenience. Ideal for precise applications, the Scotts EdgeGuard Mini Broadcast Spreader is a reliable choice for maintaining a healthy, well-fed lawn.<ul><li>Spreads lawn food or grass seed evenly with no hand cranking</li><li>Precision-rate dial lets you set the right coverage amount</li><li>EDGEGUARD lets you apply product only where you want it</li><li>Comes fully assembled and calibrated - just fill and go</li><li>Holds up to 464 m2 (5,000 ft2) of Scotts lawn products</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/4o9oMgr",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "mini-broadcast-spreader"
        },
        {
            "name": "Turf Builder Edgeguard Pro Broadcast Spreader (18,000 sq.ft)",
            "brand": "Scotts",
            "image": "Tools/scotts-pro.jpg",
            "description": "The Scotts Turf Builder EdgeGuard PRO Broadcast Spreader (model 75150) is a professional-grade lawn care tool designed for homeowners and landscapers seeking precision and efficiency. Equipped with EdgeGuard technology, it allows users to block off the right side of the spreader pattern, ensuring that product is applied only where intended, preventing waste and protecting non-lawn areas like driveways and flower beds. The spreader features a large-capacity hopper capable of covering up to 18,000 square feet, reducing the need for frequent refills during application. Its durable construction and pneumatic tires enhance maneuverability and stability, making it suitable for various terrains. Whether applying fertilizer, grass seed, weed control, or ice melt, the Scotts Turf Builder EdgeGuard PRO Broadcast Spreader offers reliable performance for year-round lawn maintenance.<ul><li>Easy-to-use spreader lets you quickly apply lawn care products - ice melt, too!</li><li>EdgeGuard Technology directs product only where you want it</li><li>The Edgeguard spreader protects landscapes, driveways, and sidewalks</li><li>Air-filled tires provide better traction, smoother ride</li><li>Holds up to 1,672 m2 (18,000 ft2) of Scotts lawn fertilizer</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/417fRCg",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "pro-broadcast-spreader"
        },
        {
            "name": "Weeding Tool with 4 Claws (39 inch)",
            "brand": "Digtokore",
            "image": "Tools/weeding-tool.jpg",
            "description": "The Digtokore Weed Puller Tool is a manual, stand-up weeding device designed to simplify the removal of stubborn weeds without the need for bending or kneeling. Featuring a 39-inch ergonomic handle, it allows users to maintain an upright posture, reducing strain on the back and knees during use. Equipped with four thickened stainless steel claws, the tool effectively penetrates the soil to grasp and extract weeds by their roots, ensuring thorough removal. The integrated foot pedal facilitates easy insertion into the ground, enhancing leverage and control. Ideal for various soil types, this weeder is particularly effective on moist ground, making it suitable for gardens, lawns, and courtyards. Its lightweight design and user-friendly operation make it a practical choice for gardeners seeking an efficient and eco-friendly solution to weed management.<ul><li>Ergonomic Weed Puller: 39\" handle length of our weeder accommodating most users, which allows you to easily remove weed in various positions without bending or kneeling. It also equipped with a push handle which allows the roots to be easily ejected from the claws.</li><li>Powerful Weeding Performance: Our weed tool equips 4 thicken 3.15\" stainless steel claws, which can easily penetrates the soil and effectively pulls out stubborn weed roots. To make weeding easier, it's recommend to use the weeding tool on wet grass after rain or irrigation rather than on dry and hard ground.</li><li>Easy to Storage: Digtokore gardening weed picker consists of an PP handle, push rod and foot pedal that is all simple to install and dismantle. It's lightweight, portable, and easy to clean. Additionally, the foot pedal can be easily retracted by gently pulling the slide rod, which makes it easy to store it in your garage or garden shed.</li><li>Robust and Sturdy: The standing weeder puller is made of stainless steel claw and has a sturdy Aluminum alloy handle. The foot pedal is reinforced with sturdy fiberglass, eschewing the fragility of plastic. You don't need to worry about our weeder bending or breaking during use.</li><li>Ideal Gift: Our weeding tools is the practical gift choice for gardening enthusiasts, house warming, Thanksgiving, Christmas etc.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/479iTto",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "weeding-tool-with-4-claws"
        },
        {
            "name": "Wheel Rotary Edger (69.7 inch)",
            "brand": "Walensee",
            "image": "Tools/manual-edger.jpg",
            "description": "The Walensee Wheel Rotary Edger is a manual lawn tool designed to provide precise and efficient edging along sidewalks, driveways, and garden beds. Featuring a 69.7-inch adjustable stainless steel handle, it accommodates users of various heights, promoting comfortable, upright operation. The edger is equipped with high-strength, chrome-plated alloy steel blades that boast a serrated edge, enhancing cutting power and durability while resisting rust. Its 2.4-inch wide roller ensures stability on uneven terrain, facilitating smooth movement and consistent results. The cushioned grip handle reduces hand fatigue, allowing for extended use without discomfort. This tool's ergonomic design and robust construction make it a reliable choice for homeowners seeking to maintain clean and defined lawn edges with minimal effort.<ul><li>High-strength Blades: This wheeled rotary edger is equipped with high-quality blades featuring a chrome-plated surface for durability and rust resistance. The alloy steel material enhances the blades' hardness and sharpness, ensuring superior cutting performance and long-lasting durability. The serrated design boosts the blades' cutting power, making it easier to trim lawn edges with precision, keeping your yard looking neat and tidy.</li><li>2.4 Inch Wider Roller: This hand manual edger lawn tool comes with a 2.4 inch wider roller, which enhances stability and balance as the tool glides along the edges. The increased width helps distribute the weight of the edger more evenly, allowing it to move smoothly over uneven ground without getting stuck or tipping over. Additionally, the orange bracket of the trimmer has been thickened to make it stronger and more resistant during use.</li><li>Adjustable Stainless Steel Handle: The trimming grass weed edger comes with an adjustable handle that can be set to three different heights: 40.2 inch, 54.7 inch, and 69.7 inch, to suit users of various heights. And the handle is made from durable stainless steel, which offers excellent toughness. Its reinforced design further enhances durability, preventing bending or deformation. Moreover, the trimmer is equipped with a rubber soft grip on the handle for a more comfortable hold.</li><li>Easy to Install and Use: The lawn trimmer is designed for simplicity and ease of use. Just align the holes, insert the screws and tighten them, then twist the threaded pipe clockwise to secure the handle and put it into use. When in use, the ergonomic handle provides a natural, comfortable grip, reducing fatigue. Even beginners can quickly learn how to operate it, achieving perfect edging while saving time and effort, and improving the overall appearance of your lawn.</li><li>Universal Garden Partner: The lawn edger can be used years round and is perfect for a variety of outdoor area, including garden, sidewalks, driveways, lawns, and landscaping. It's great for trimming weeds in your yard, helping to keep your outdoor space neat and tidy. Thank you for choosing our Walensee Lawn Edger. If you have any problems while using it, please don't hesitate to reach out to us. We're here to assist you anytime.</li></ul>",
            "notes": "",
            "amazonLink": "https://amzn.to/44RPNNV",
            "walmartLink": "",
            "homeHardwareLink": "",
            "homeDepotLink": "",
            "lowesLink": "",
            "canadianTireLink": "",
            "ronaLink": "",
            "link": "manual-edger"
        }
    ]
}